[Survived] ArithmeticOperator
lib/idempotency.ts:3:38
 import { getRuntimeStateAdapter } from "@/lib/runtime-state";
 
-const DEFAULT_RESPONSE_TTL_SECONDS = 60 * 60 * 24;
+const DEFAULT_RESPONSE_TTL_SECONDS = 60 / 60 * 24;
 const DEFAULT_LOCK_TTL_SECONDS = 60;
 

[Survived] ArithmeticOperator
lib/idempotency.ts:3:38
 import { getRuntimeStateAdapter } from "@/lib/runtime-state";
 
-const DEFAULT_RESPONSE_TTL_SECONDS = 60 * 60 * 24;
+const DEFAULT_RESPONSE_TTL_SECONDS = 60 * 60 / 24;
 const DEFAULT_LOCK_TTL_SECONDS = 60;
 

[Survived] BlockStatement
lib/idempotency.ts:13:41
   storedAt: string;
 };
 
-function sanitizeSegment(value: string) {
-  return value.replace(/[^a-zA-Z0-9:_-]/g, "_");
-}
+function sanitizeSegment(value: string) {}
 
 export function getIdempotencyKeyFromRequest(request: Request) {

[Survived] StringLiteral
lib/idempotency.ts:14:44
 };
 
 function sanitizeSegment(value: string) {
-  return value.replace(/[^a-zA-Z0-9:_-]/g, "_");
+  return value.replace(/[^a-zA-Z0-9:_-]/g, "");
 }
 

[Survived] Regex
lib/idempotency.ts:14:24
 };
 
 function sanitizeSegment(value: string) {
-  return value.replace(/[^a-zA-Z0-9:_-]/g, "_");
+  return value.replace(/[a-zA-Z0-9:_-]/g, "_");
 }
 

[Survived] BlockStatement
lib/idempotency.ts:17:64
   return value.replace(/[^a-zA-Z0-9:_-]/g, "_");
 }
 
-export function getIdempotencyKeyFromRequest(request: Request) {
-  const key = request.headers.get("idempotency-key")?.trim();
-  if (!key) {
-    return null;
-  }
-  if (key.length < 4 || key.length > 128) {
-    return null;
-  }
-  return key;
-}
+export function getIdempotencyKeyFromRequest(request: Request) {}
 
 export function buildIdempotencyScopeKey(params: {

[Killed] OptionalChaining
lib/idempotency.ts:18:15
 }
 
 export function getIdempotencyKeyFromRequest(request: Request) {
-  const key = request.headers.get("idempotency-key")?.trim();
+  const key = request.headers.get("idempotency-key").trim();
   if (!key) {
     return null;
killedBy: POST /api/process rejects bad JSON
statusReason: expected 500 to be 400 // Object.is equality

[Survived] MethodExpression
lib/idempotency.ts:18:15
 }
 
 export function getIdempotencyKeyFromRequest(request: Request) {
-  const key = request.headers.get("idempotency-key")?.trim();
+  const key = request.headers.get("idempotency-key");
   if (!key) {
     return null;

[Killed] BlockStatement
lib/idempotency.ts:19:13
 
 export function getIdempotencyKeyFromRequest(request: Request) {
   const key = request.headers.get("idempotency-key")?.trim();
-  if (!key) {
-    return null;
-  }
+  if (!key) {}
   if (key.length < 4 || key.length > 128) {
     return null;
killedBy: POST /api/process rejects bad JSON
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BooleanLiteral
lib/idempotency.ts:19:7
 
 export function getIdempotencyKeyFromRequest(request: Request) {
   const key = request.headers.get("idempotency-key")?.trim();
-  if (!key) {
+  if (key) {
     return null;
   }
killedBy: POST /api/process rejects bad JSON
statusReason: expected 500 to be 400 // Object.is equality

[NoCoverage] ConditionalExpression
lib/idempotency.ts:22:7
   if (!key) {
     return null;
   }
-  if (key.length < 4 || key.length > 128) {
+  if (false) {
     return null;
   }

[NoCoverage] ConditionalExpression
lib/idempotency.ts:22:7
   if (!key) {
     return null;
   }
-  if (key.length < 4 || key.length > 128) {
+  if (false || key.length > 128) {
     return null;
   }

[Survived] BlockStatement
lib/idempotency.ts:33:4
   workspaceId: string;
   userId: string;
   key: string;
-}) {
-  return [
-    "idem",
-    sanitizeSegment(params.route),
-    sanitizeSegment(params.workspaceId),
-    sanitizeSegment(params.userId),
-    sanitizeSegment(params.key),
-  ].join(":");
-}
+}) {}
 
 function responseKey(scopeKey: string) {

[Survived] StringLiteral
lib/idempotency.ts:35:5
   key: string;
 }) {
   return [
-    "idem",
+    "",
     sanitizeSegment(params.route),
     sanitizeSegment(params.workspaceId),

[Survived] BlockStatement
lib/idempotency.ts:43:40
   ].join(":");
 }
 
-function responseKey(scopeKey: string) {
-  return `${scopeKey}:response`;
-}
+function responseKey(scopeKey: string) {}
 
 function lockKey(scopeKey: string) {

[Survived] StringLiteral
lib/idempotency.ts:44:10
 }
 
 function responseKey(scopeKey: string) {
-  return `${scopeKey}:response`;
+  return ``;
 }
 

[Survived] BlockStatement
lib/idempotency.ts:47:36
   return `${scopeKey}:response`;
 }
 
-function lockKey(scopeKey: string) {
-  return `${scopeKey}:lock`;
-}
+function lockKey(scopeKey: string) {}
 
 export async function loadIdempotentResponse(scopeKey: string) {

[Survived] StringLiteral
lib/idempotency.ts:48:10
 }
 
 function lockKey(scopeKey: string) {
-  return `${scopeKey}:lock`;
+  return ``;
 }
 

[Killed] BlockStatement
lib/idempotency.ts:51:64
   return `${scopeKey}:lock`;
 }
 
-export async function loadIdempotentResponse(scopeKey: string) {
-  const raw = await getRuntimeStateAdapter().get(responseKey(scopeKey));
-  if (!raw) {
-    return null;
-  }
-
-  try {
-    const parsed = JSON.parse(raw) as StoredIdempotentResponse;
-    if (
-      typeof parsed.status !== "number" ||
-      typeof parsed.storedAt !== "string" ||
-      parsed.body === undefined
-    ) {
-      return null;
-    }
-    return parsed;
-  } catch {
-    return null;
-  }
-}
+export async function loadIdempotentResponse(scopeKey: string) {}
 
 export async function acquireIdempotencyLock(
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected undefined to be 202 // Object.is equality

[Killed] ConditionalExpression
lib/idempotency.ts:53:7
 
 export async function loadIdempotentResponse(scopeKey: string) {
   const raw = await getRuntimeStateAdapter().get(responseKey(scopeKey));
-  if (!raw) {
+  if (true) {
     return null;
   }
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected null not to be null

[Killed] BooleanLiteral
lib/idempotency.ts:53:7
 
 export async function loadIdempotentResponse(scopeKey: string) {
   const raw = await getRuntimeStateAdapter().get(responseKey(scopeKey));
-  if (!raw) {
+  if (raw) {
     return null;
   }
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected null not to be null

[Killed] BlockStatement
lib/idempotency.ts:57:7
     return null;
   }
 
-  try {
-    const parsed = JSON.parse(raw) as StoredIdempotentResponse;
-    if (
-      typeof parsed.status !== "number" ||
-      typeof parsed.storedAt !== "string" ||
-      parsed.body === undefined
-    ) {
-      return null;
-    }
-    return parsed;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected undefined to be 202 // Object.is equality

[Killed] ConditionalExpression
lib/idempotency.ts:60:7
   try {
     const parsed = JSON.parse(raw) as StoredIdempotentResponse;
     if (
-      typeof parsed.status !== "number" ||
-      typeof parsed.storedAt !== "string" ||
-      parsed.body === undefined
+      true
     ) {
       return null;
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected null not to be null

[Killed] EqualityOperator
lib/idempotency.ts:60:7
   try {
     const parsed = JSON.parse(raw) as StoredIdempotentResponse;
     if (
-      typeof parsed.status !== "number" ||
+      typeof parsed.status === "number" ||
       typeof parsed.storedAt !== "string" ||
       parsed.body === undefined
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected null not to be null

[Killed] EqualityOperator
lib/idempotency.ts:61:7
     const parsed = JSON.parse(raw) as StoredIdempotentResponse;
     if (
       typeof parsed.status !== "number" ||
-      typeof parsed.storedAt !== "string" ||
+      typeof parsed.storedAt === "string" ||
       parsed.body === undefined
     ) {
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected null not to be null

[Survived] ConditionalExpression
lib/idempotency.ts:61:7
     const parsed = JSON.parse(raw) as StoredIdempotentResponse;
     if (
       typeof parsed.status !== "number" ||
-      typeof parsed.storedAt !== "string" ||
+      false ||
       parsed.body === undefined
     ) {

[Killed] EqualityOperator
lib/idempotency.ts:62:7
     if (
       typeof parsed.status !== "number" ||
       typeof parsed.storedAt !== "string" ||
-      parsed.body === undefined
+      parsed.body !== undefined
     ) {
       return null;
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected null not to be null

[Survived] ConditionalExpression
lib/idempotency.ts:62:7
     if (
       typeof parsed.status !== "number" ||
       typeof parsed.storedAt !== "string" ||
-      parsed.body === undefined
+      false
     ) {
       return null;

[NoCoverage] BlockStatement
lib/idempotency.ts:63:7
       typeof parsed.status !== "number" ||
       typeof parsed.storedAt !== "string" ||
       parsed.body === undefined
-    ) {
-      return null;
-    }
+    ) {}
     return parsed;
   } catch {

[NoCoverage] BlockStatement
lib/idempotency.ts:67:11
       return null;
     }
     return parsed;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
lib/idempotency.ts:75:3
 export async function acquireIdempotencyLock(
   scopeKey: string,
   ttlSeconds = DEFAULT_LOCK_TTL_SECONDS,
-) {
-  return getRuntimeStateAdapter().setIfAbsent(lockKey(scopeKey), "1", ttlSeconds);
-}
+) {}
 
 export async function releaseIdempotencyLock(scopeKey: string) {
killedBy: idempotency store prevents duplicate in-flight requests using lock
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
lib/idempotency.ts:76:66
   scopeKey: string,
   ttlSeconds = DEFAULT_LOCK_TTL_SECONDS,
 ) {
-  return getRuntimeStateAdapter().setIfAbsent(lockKey(scopeKey), "1", ttlSeconds);
+  return getRuntimeStateAdapter().setIfAbsent(lockKey(scopeKey), "", ttlSeconds);
 }
 

[Killed] BlockStatement
lib/idempotency.ts:79:64
   return getRuntimeStateAdapter().setIfAbsent(lockKey(scopeKey), "1", ttlSeconds);
 }
 
-export async function releaseIdempotencyLock(scopeKey: string) {
-  await getRuntimeStateAdapter().del(lockKey(scopeKey));
-}
+export async function releaseIdempotencyLock(scopeKey: string) {}
 
 export async function storeIdempotentResponse(
killedBy: idempotency store prevents duplicate in-flight requests using lock
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/idempotency.ts:87:3
   scopeKey: string,
   response: StoredIdempotentResponse,
   ttlSeconds = DEFAULT_RESPONSE_TTL_SECONDS,
-) {
-  await getRuntimeStateAdapter().set(
-    responseKey(scopeKey),
-    JSON.stringify(response),
-    ttlSeconds,
-  );
-}
+) {}
 
killedBy: idempotency store stores and replays responses by scope key
statusReason: expected null not to be null
