[Killed] StringLiteral
lib/auth.ts:14:24
   role: SessionRole;
 };
 
-const SESSION_COOKIE = "vaa_demo_session";
+const SESSION_COOKIE = "";
 
 export const DEFAULT_SESSION: SessionData = {
killedBy: getSessionCookieName returns the cookie name constant
statusReason: expected '' to be 'vaa_demo_session' // Object.is equality

[Killed] StringLiteral
lib/auth.ts:17:11
 const SESSION_COOKIE = "vaa_demo_session";
 
 export const DEFAULT_SESSION: SessionData = {
-  userId: "demo-user",
+  userId: "",
   name: "Demo User",
   email: "demo@voice-action.local",
killedBy: DEFAULT_SESSION has required fields with exact values
statusReason: expected '' to be 'demo-user' // Object.is equality

[Killed] StringLiteral
lib/auth.ts:20:16
   userId: "demo-user",
   name: "Demo User",
   email: "demo@voice-action.local",
-  workspaceId: "default-workspace",
+  workspaceId: "",
   role: "owner",
 };
killedBy: DEFAULT_SESSION has required fields with exact values
statusReason: expected '' to be 'default-workspace' // Object.is equality

[Killed] BlockStatement
lib/auth.ts:31:74
 
 const SESSION_SIGNATURE_PREFIX = "v1";
 
-function normalizeSession(raw: Partial<SessionData>): SessionData | null {
-  const parsedRole: SessionRole | null =
-    raw.role === "owner" || raw.role === "admin" || raw.role === "agent" || raw.role === "viewer"
-      ? raw.role
-      : null;
-  if (!raw.userId || !raw.workspaceId || !parsedRole) {
-    return null;
-  }
-
-  return {
-    ...DEFAULT_SESSION,
-    ...raw,
-    role: parsedRole,
-  };
-}
+function normalizeSession(raw: Partial<SessionData>): SessionData | null {}
 
 function getSessionSigningSecret() {
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:33:5
 
 function normalizeSession(raw: Partial<SessionData>): SessionData | null {
   const parsedRole: SessionRole | null =
-    raw.role === "owner" || raw.role === "admin" || raw.role === "agent" || raw.role === "viewer"
+    false || raw.role === "viewer"
       ? raw.role
       : null;
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:33:5
 
 function normalizeSession(raw: Partial<SessionData>): SessionData | null {
   const parsedRole: SessionRole | null =
-    raw.role === "owner" || raw.role === "admin" || raw.role === "agent" || raw.role === "viewer"
+    false
       ? raw.role
       : null;
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] BooleanLiteral
lib/auth.ts:36:22
     raw.role === "owner" || raw.role === "admin" || raw.role === "agent" || raw.role === "viewer"
       ? raw.role
       : null;
-  if (!raw.userId || !raw.workspaceId || !parsedRole) {
+  if (!raw.userId || raw.workspaceId || !parsedRole) {
     return null;
   }
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:36:7
     raw.role === "owner" || raw.role === "admin" || raw.role === "agent" || raw.role === "viewer"
       ? raw.role
       : null;
-  if (!raw.userId || !raw.workspaceId || !parsedRole) {
+  if (false) {
     return null;
   }
killedBy: parseSessionCookieValue returns null when payload is valid JSON but missing required fields
statusReason: expected { session: { …(5) }, signed: false } to be null

[Killed] BlockStatement
lib/auth.ts:47:36
   };
 }
 
-function getSessionSigningSecret() {
-  return process.env.SESSION_SIGNING_SECRET?.trim() || null;
-}
+function getSessionSigningSecret() {}
 
 function requireSignedSessionInProd() {
killedBy: parseSessionCookieValue returns null when signature is wrong
statusReason: expected { …(2) } to be null

[Killed] OptionalChaining
lib/auth.ts:48:10
 }
 
 function getSessionSigningSecret() {
-  return process.env.SESSION_SIGNING_SECRET?.trim() || null;
+  return process.env.SESSION_SIGNING_SECRET.trim() || null;
 }
 
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:48:10
 }
 
 function getSessionSigningSecret() {
-  return process.env.SESSION_SIGNING_SECRET?.trim() || null;
+  return true;
 }
 
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] BlockStatement
lib/auth.ts:51:39
   return process.env.SESSION_SIGNING_SECRET?.trim() || null;
 }
 
-function requireSignedSessionInProd() {
-  const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD?.trim().toLowerCase();
-  if (!raw) {
-    return true;
-  }
-  return ["1", "true", "yes", "on"].includes(raw);
-}
+function requireSignedSessionInProd() {}
 
 function signPayload(payloadBase64Url: string, secret: string) {
killedBy: parseSessionCookieValue returns null in production when no secret and REQUIRE_SIGNED is default-true
statusReason: expected { …(2) } to be null

[Killed] MethodExpression
lib/auth.ts:52:15
 }
 
 function requireSignedSessionInProd() {
-  const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD?.trim().toLowerCase();
+  const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD?.trim().toUpperCase();
   if (!raw) {
     return true;
killedBy: requireSignedSessionInProd via parseSessionCookieValue REQUIRE_SIGNED_SESSION_IN_PROD="true" + no secret → null in production
statusReason: expected { …(2) } to be null

[Survived] OptionalChaining
lib/auth.ts:52:15
 }
 
 function requireSignedSessionInProd() {
-  const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD?.trim().toLowerCase();
+  const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD.trim().toLowerCase();
   if (!raw) {
     return true;

[Killed] ConditionalExpression
lib/auth.ts:53:7
 
 function requireSignedSessionInProd() {
   const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD?.trim().toLowerCase();
-  if (!raw) {
+  if (false) {
     return true;
   }
killedBy: parseSessionCookieValue returns null in production when no secret and REQUIRE_SIGNED is default-true
statusReason: expected { …(2) } to be null

[Killed] ConditionalExpression
lib/auth.ts:53:7
 
 function requireSignedSessionInProd() {
   const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD?.trim().toLowerCase();
-  if (!raw) {
+  if (true) {
     return true;
   }
killedBy: requireSignedSessionInProd via parseSessionCookieValue REQUIRE_SIGNED_SESSION_IN_PROD="false" → unsigned cookie accepted in production
statusReason: expected null not to be null

[Killed] BooleanLiteral
lib/auth.ts:54:12
 function requireSignedSessionInProd() {
   const raw = process.env.REQUIRE_SIGNED_SESSION_IN_PROD?.trim().toLowerCase();
   if (!raw) {
-    return true;
+    return false;
   }
   return ["1", "true", "yes", "on"].includes(raw);
killedBy: parseSessionCookieValue returns null in production when no secret and REQUIRE_SIGNED is default-true
statusReason: expected { …(2) } to be null

[Killed] StringLiteral
lib/auth.ts:56:16
   if (!raw) {
     return true;
   }
-  return ["1", "true", "yes", "on"].includes(raw);
+  return ["1", "", "yes", "on"].includes(raw);
 }
 
killedBy: requireSignedSessionInProd via parseSessionCookieValue REQUIRE_SIGNED_SESSION_IN_PROD="true" + no secret → null in production
statusReason: expected { …(2) } to be null

[Killed] BlockStatement
lib/auth.ts:59:64
   return ["1", "true", "yes", "on"].includes(raw);
 }
 
-function signPayload(payloadBase64Url: string, secret: string) {
-  const hmac = createHmac("sha256", secret);
-  hmac.update(`${SESSION_SIGNATURE_PREFIX}.${payloadBase64Url}`);
-  return hmac.digest("base64url");
-}
+function signPayload(payloadBase64Url: string, secret: string) {}
 
 function verifySignature(payloadBase64Url: string, signatureBase64Url: string, secret: string) {
killedBy: parseSessionCookieValue parses a signed cookie when secret matches
statusReason: expected null not to be null

[Killed] StringLiteral
lib/auth.ts:60:27
 }
 
 function signPayload(payloadBase64Url: string, secret: string) {
-  const hmac = createHmac("sha256", secret);
+  const hmac = createHmac("", secret);
   hmac.update(`${SESSION_SIGNATURE_PREFIX}.${payloadBase64Url}`);
   return hmac.digest("base64url");
killedBy: parseSessionCookieValue parses a signed cookie when secret matches
statusReason: expected null not to be null

[Killed] BlockStatement
lib/auth.ts:65:96
   return hmac.digest("base64url");
 }
 
-function verifySignature(payloadBase64Url: string, signatureBase64Url: string, secret: string) {
-  const expected = signPayload(payloadBase64Url, secret);
-  const expectedBuffer = Buffer.from(expected, "utf8");
-  const providedBuffer = Buffer.from(signatureBase64Url, "utf8");
-
-  if (expectedBuffer.length !== providedBuffer.length) {
-    return false;
-  }
-
-  return timingSafeEqual(expectedBuffer, providedBuffer);
-}
+function verifySignature(payloadBase64Url: string, signatureBase64Url: string, secret: string) {}
 
 function decodeSession(raw: string): ParsedSessionCookie | null {
killedBy: parseSessionCookieValue parses a signed cookie when secret matches
statusReason: expected null not to be null

[Survived] StringLiteral
lib/auth.ts:67:48
 
 function verifySignature(payloadBase64Url: string, signatureBase64Url: string, secret: string) {
   const expected = signPayload(payloadBase64Url, secret);
-  const expectedBuffer = Buffer.from(expected, "utf8");
+  const expectedBuffer = Buffer.from(expected, "");
   const providedBuffer = Buffer.from(signatureBase64Url, "utf8");
 

[Killed] EqualityOperator
lib/auth.ts:70:7
   const expectedBuffer = Buffer.from(expected, "utf8");
   const providedBuffer = Buffer.from(signatureBase64Url, "utf8");
 
-  if (expectedBuffer.length !== providedBuffer.length) {
+  if (expectedBuffer.length === providedBuffer.length) {
     return false;
   }
killedBy: parseSessionCookieValue parses a signed cookie when secret matches
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:70:7
   const expectedBuffer = Buffer.from(expected, "utf8");
   const providedBuffer = Buffer.from(signatureBase64Url, "utf8");
 
-  if (expectedBuffer.length !== providedBuffer.length) {
+  if (true) {
     return false;
   }
killedBy: parseSessionCookieValue parses a signed cookie when secret matches
statusReason: expected null not to be null

[NoCoverage] BooleanLiteral
lib/auth.ts:71:12
   const providedBuffer = Buffer.from(signatureBase64Url, "utf8");
 
   if (expectedBuffer.length !== providedBuffer.length) {
-    return false;
+    return true;
   }
 

[Killed] ConditionalExpression
lib/auth.ts:80:27
 function decodeSession(raw: string): ParsedSessionCookie | null {
   try {
     const secret = getSessionSigningSecret();
-    const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
+    const requireSigned = false;
     if (requireSigned && !secret) {
       return null;
killedBy: parseSessionCookieValue returns null in production when no secret and REQUIRE_SIGNED is default-true
statusReason: expected { …(2) } to be null

[Killed] EqualityOperator
lib/auth.ts:80:27
 function decodeSession(raw: string): ParsedSessionCookie | null {
   try {
     const secret = getSessionSigningSecret();
-    const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
+    const requireSigned = process.env.NODE_ENV !== "production" && requireSignedSessionInProd();
     if (requireSigned && !secret) {
       return null;
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:81:9
   try {
     const secret = getSessionSigningSecret();
     const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
-    if (requireSigned && !secret) {
+    if (false) {
       return null;
     }
killedBy: parseSessionCookieValue returns null in production when no secret and REQUIRE_SIGNED is default-true
statusReason: expected { …(2) } to be null

[Killed] LogicalOperator
lib/auth.ts:81:9
   try {
     const secret = getSessionSigningSecret();
     const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
-    if (requireSigned && !secret) {
+    if (requireSigned || !secret) {
       return null;
     }
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:85:30
       return null;
     }
     const [payloadBase64Url, signatureBase64Url, ...rest] = raw.split(".");
-    if (!payloadBase64Url || rest.length > 0) {
+    if (!payloadBase64Url || false) {
       return null;
     }
killedBy: parseSessionCookieValue returns null for a payload with extra dots (>2 segments)
statusReason: expected { …(2) } to be null

[Killed] ConditionalExpression
lib/auth.ts:85:9
       return null;
     }
     const [payloadBase64Url, signatureBase64Url, ...rest] = raw.split(".");
-    if (!payloadBase64Url || rest.length > 0) {
+    if (true) {
       return null;
     }
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:90:9
     }
 
     const signed = Boolean(signatureBase64Url);
-    if (requireSigned && !signed) {
+    if (true) {
       return null;
     }
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] LogicalOperator
lib/auth.ts:90:9
     }
 
     const signed = Boolean(signatureBase64Url);
-    if (requireSigned && !signed) {
+    if (requireSigned || !signed) {
       return null;
     }
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:93:9
     if (requireSigned && !signed) {
       return null;
     }
-    if (secret) {
+    if (false) {
       if (!signed || !signatureBase64Url) {
         return null;
killedBy: parseSessionCookieValue returns null when signature is wrong
statusReason: expected { …(2) } to be null

[Killed] BlockStatement
lib/auth.ts:93:17
     if (requireSigned && !signed) {
       return null;
     }
-    if (secret) {
-      if (!signed || !signatureBase64Url) {
-        return null;
-      }
-      if (!verifySignature(payloadBase64Url, signatureBase64Url, secret)) {
-        return null;
-      }
-    }
+    if (secret) {}
 
     const parsed = JSON.parse(Buffer.from(payloadBase64Url, "base64url").toString("utf8")) as Partial<SessionData>;
killedBy: parseSessionCookieValue returns null when signature is wrong
statusReason: expected { …(2) } to be null

[Killed] BooleanLiteral
lib/auth.ts:94:11
       return null;
     }
     if (secret) {
-      if (!signed || !signatureBase64Url) {
+      if (signed || !signatureBase64Url) {
         return null;
       }
killedBy: parseSessionCookieValue parses a signed cookie when secret matches
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:94:11
       return null;
     }
     if (secret) {
-      if (!signed || !signatureBase64Url) {
+      if (true) {
         return null;
       }
killedBy: parseSessionCookieValue parses a signed cookie when secret matches
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:97:11
       if (!signed || !signatureBase64Url) {
         return null;
       }
-      if (!verifySignature(payloadBase64Url, signatureBase64Url, secret)) {
+      if (true) {
         return null;
       }
killedBy: getSessionContextFromRequest prefers signed cookie session when secret is configured
statusReason: expected 'proxy_header_fallback' to be 'cookie_signed' // Object.is equality

[Killed] BlockStatement
lib/auth.ts:97:75
       if (!signed || !signatureBase64Url) {
         return null;
       }
-      if (!verifySignature(payloadBase64Url, signatureBase64Url, secret)) {
-        return null;
-      }
+      if (!verifySignature(payloadBase64Url, signatureBase64Url, secret)) {}
     }
 
killedBy: parseSessionCookieValue returns null when signature is wrong
statusReason: expected { …(2) } to be null

[Killed] BlockStatement
lib/auth.ts:104:19
 
     const parsed = JSON.parse(Buffer.from(payloadBase64Url, "base64url").toString("utf8")) as Partial<SessionData>;
     const session = normalizeSession(parsed);
-    if (!session) {
-      return null;
-    }
+    if (!session) {}
 
     return {
killedBy: parseSessionCookieValue returns null when payload is valid JSON but missing required fields
statusReason: expected { session: null, signed: false } to be null

[Killed] BooleanLiteral
lib/auth.ts:104:9
 
     const parsed = JSON.parse(Buffer.from(payloadBase64Url, "base64url").toString("utf8")) as Partial<SessionData>;
     const session = normalizeSession(parsed);
-    if (!session) {
+    if (session) {
       return null;
     }
killedBy: getSessionContextFromRequest prefers signed cookie session when secret is configured
statusReason: expected 'proxy_header_fallback' to be 'cookie_signed' // Object.is equality

[NoCoverage] BlockStatement
lib/auth.ts:117:46
   }
 }
 
-function encodeSession(session: SessionData) {
-  const payloadBase64Url = Buffer.from(JSON.stringify(session), "utf8").toString("base64url");
-  const secret = getSessionSigningSecret();
-  const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
-  if (requireSigned && !secret) {
-    throw new Error(
-      "SESSION_SIGNING_SECRET is required when REQUIRE_SIGNED_SESSION_IN_PROD=true.",
-    );
-  }
-  if (!secret) {
-    return payloadBase64Url;
-  }
-
-  const signatureBase64Url = signPayload(payloadBase64Url, secret);
-  return `${payloadBase64Url}.${signatureBase64Url}`;
-}
+function encodeSession(session: SessionData) {}
 
 export function parseSessionCookieValue(raw?: string | null) {

[NoCoverage] StringLiteral
lib/auth.ts:118:65
 }
 
 function encodeSession(session: SessionData) {
-  const payloadBase64Url = Buffer.from(JSON.stringify(session), "utf8").toString("base64url");
+  const payloadBase64Url = Buffer.from(JSON.stringify(session), "").toString("base64url");
   const secret = getSessionSigningSecret();
   const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();

[NoCoverage] LogicalOperator
lib/auth.ts:120:25
 function encodeSession(session: SessionData) {
   const payloadBase64Url = Buffer.from(JSON.stringify(session), "utf8").toString("base64url");
   const secret = getSessionSigningSecret();
-  const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
+  const requireSigned = process.env.NODE_ENV === "production" || requireSignedSessionInProd();
   if (requireSigned && !secret) {
     throw new Error(

[NoCoverage] ConditionalExpression
lib/auth.ts:121:7
   const payloadBase64Url = Buffer.from(JSON.stringify(session), "utf8").toString("base64url");
   const secret = getSessionSigningSecret();
   const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
-  if (requireSigned && !secret) {
+  if (true) {
     throw new Error(
       "SESSION_SIGNING_SECRET is required when REQUIRE_SIGNED_SESSION_IN_PROD=true.",

[NoCoverage] StringLiteral
lib/auth.ts:123:7
   const requireSigned = process.env.NODE_ENV === "production" && requireSignedSessionInProd();
   if (requireSigned && !secret) {
     throw new Error(
-      "SESSION_SIGNING_SECRET is required when REQUIRE_SIGNED_SESSION_IN_PROD=true.",
+      "",
     );
   }

[NoCoverage] ConditionalExpression
lib/auth.ts:126:7
       "SESSION_SIGNING_SECRET is required when REQUIRE_SIGNED_SESSION_IN_PROD=true.",
     );
   }
-  if (!secret) {
+  if (true) {
     return payloadBase64Url;
   }

[NoCoverage] BooleanLiteral
lib/auth.ts:126:7
       "SESSION_SIGNING_SECRET is required when REQUIRE_SIGNED_SESSION_IN_PROD=true.",
     );
   }
-  if (!secret) {
+  if (secret) {
     return payloadBase64Url;
   }

[Killed] BlockStatement
lib/auth.ts:134:62
   return `${payloadBase64Url}.${signatureBase64Url}`;
 }
 
-export function parseSessionCookieValue(raw?: string | null) {
-  if (!raw) {
-    return null;
-  }
-
-  return decodeSession(raw);
-}
+export function parseSessionCookieValue(raw?: string | null) {}
 
 export function getSessionCookieName() {
killedBy: parseSessionCookieValue returns null for null/undefined/empty
statusReason: expected undefined to be null

[Killed] BooleanLiteral
lib/auth.ts:135:7
 }
 
 export function parseSessionCookieValue(raw?: string | null) {
-  if (!raw) {
+  if (raw) {
     return null;
   }
killedBy: parseSessionCookieValue parses an unsigned cookie when no secret is set
statusReason: expected null not to be null

[Killed] ConditionalExpression
lib/auth.ts:135:7
 }
 
 export function parseSessionCookieValue(raw?: string | null) {
-  if (!raw) {
+  if (true) {
     return null;
   }
killedBy: getSessionContextFromRequest prefers signed cookie session when secret is configured
statusReason: expected 'proxy_header_fallback' to be 'cookie_signed' // Object.is equality

[Killed] BlockStatement
lib/auth.ts:142:40
   return decodeSession(raw);
 }
 
-export function getSessionCookieName() {
-  return SESSION_COOKIE;
-}
+export function getSessionCookieName() {}
 
 export async function getServerSession() {
killedBy: getSessionCookieName returns the cookie name constant
statusReason: expected undefined to be 'vaa_demo_session' // Object.is equality

[NoCoverage] BlockStatement
lib/auth.ts:146:42
   return SESSION_COOKIE;
 }
 
-export async function getServerSession() {
-  const cookieStore = await cookies();
-  const value = cookieStore.get(SESSION_COOKIE)?.value;
-  if (!value) {
-    return DEFAULT_SESSION;
-  }
-
-  return decodeSession(value)?.session ?? DEFAULT_SESSION;
-}
+export async function getServerSession() {}
 
 export async function setServerSession(session: Partial<SessionData>) {

[NoCoverage] OptionalChaining
lib/auth.ts:148:17
 
 export async function getServerSession() {
   const cookieStore = await cookies();
-  const value = cookieStore.get(SESSION_COOKIE)?.value;
+  const value = cookieStore.get(SESSION_COOKIE).value;
   if (!value) {
     return DEFAULT_SESSION;

[NoCoverage] ConditionalExpression
lib/auth.ts:149:7
 export async function getServerSession() {
   const cookieStore = await cookies();
   const value = cookieStore.get(SESSION_COOKIE)?.value;
-  if (!value) {
+  if (true) {
     return DEFAULT_SESSION;
   }

[NoCoverage] BooleanLiteral
lib/auth.ts:149:7
 export async function getServerSession() {
   const cookieStore = await cookies();
   const value = cookieStore.get(SESSION_COOKIE)?.value;
-  if (!value) {
+  if (value) {
     return DEFAULT_SESSION;
   }

[NoCoverage] OptionalChaining
lib/auth.ts:153:10
     return DEFAULT_SESSION;
   }
 
-  return decodeSession(value)?.session ?? DEFAULT_SESSION;
+  return decodeSession(value).session ?? DEFAULT_SESSION;
 }
 

[NoCoverage] LogicalOperator
lib/auth.ts:153:10
     return DEFAULT_SESSION;
   }
 
-  return decodeSession(value)?.session ?? DEFAULT_SESSION;
+  return decodeSession(value)?.session && DEFAULT_SESSION;
 }
 

[NoCoverage] BlockStatement
lib/auth.ts:156:71
   return decodeSession(value)?.session ?? DEFAULT_SESSION;
 }
 
-export async function setServerSession(session: Partial<SessionData>) {
-  const cookieStore = await cookies();
-  const merged: SessionData = {
-    ...DEFAULT_SESSION,
-    ...session,
-  };
-
-  cookieStore.set({
-    name: SESSION_COOKIE,
-    value: encodeSession(merged),
-    httpOnly: true,
-    sameSite: "strict",
-    secure: process.env.NODE_ENV === "production",
-    path: "/",
-    maxAge: 60 * 60 * 24 * 14,
-  });
-
-  return merged;
-}
+export async function setServerSession(session: Partial<SessionData>) {}
 
 export async function clearServerSession() {

[NoCoverage] ObjectLiteral
lib/auth.ts:163:19
     ...session,
   };
 
-  cookieStore.set({
-    name: SESSION_COOKIE,
-    value: encodeSession(merged),
-    httpOnly: true,
-    sameSite: "strict",
-    secure: process.env.NODE_ENV === "production",
-    path: "/",
-    maxAge: 60 * 60 * 24 * 14,
-  });
+  cookieStore.set({});
 
   return merged;

[NoCoverage] BooleanLiteral
lib/auth.ts:166:15
   cookieStore.set({
     name: SESSION_COOKIE,
     value: encodeSession(merged),
-    httpOnly: true,
+    httpOnly: false,
     sameSite: "strict",
     secure: process.env.NODE_ENV === "production",

[NoCoverage] ConditionalExpression
lib/auth.ts:168:13
     value: encodeSession(merged),
     httpOnly: true,
     sameSite: "strict",
-    secure: process.env.NODE_ENV === "production",
+    secure: true,
     path: "/",
     maxAge: 60 * 60 * 24 * 14,

[NoCoverage] EqualityOperator
lib/auth.ts:168:13
     value: encodeSession(merged),
     httpOnly: true,
     sameSite: "strict",
-    secure: process.env.NODE_ENV === "production",
+    secure: process.env.NODE_ENV !== "production",
     path: "/",
     maxAge: 60 * 60 * 24 * 14,

[NoCoverage] ArithmeticOperator
lib/auth.ts:170:13
     sameSite: "strict",
     secure: process.env.NODE_ENV === "production",
     path: "/",
-    maxAge: 60 * 60 * 24 * 14,
+    maxAge: 60 / 60 * 24 * 14,
   });
 

[NoCoverage] ArithmeticOperator
lib/auth.ts:170:13
     sameSite: "strict",
     secure: process.env.NODE_ENV === "production",
     path: "/",
-    maxAge: 60 * 60 * 24 * 14,
+    maxAge: 60 * 60 * 24 / 14,
   });
 

[NoCoverage] BlockStatement
lib/auth.ts:176:44
   return merged;
 }
 
-export async function clearServerSession() {
-  const cookieStore = await cookies();
-  cookieStore.delete(SESSION_COOKIE);
-}
+export async function clearServerSession() {}
 
 export function maskEmail(email: string) {

[Killed] BlockStatement
lib/auth.ts:181:42
   cookieStore.delete(SESSION_COOKIE);
 }
 
-export function maskEmail(email: string) {
-  const [local, domain] = email.split("@");
-  if (!local || !domain) {
-    return "hidden";
-  }
-
-  if (local.length <= 2) {
-    return `${local[0] ?? "*"}*@${domain}`;
-  }
-
-  return `${local.slice(0, 2)}***@${domain}`;
-}
+export function maskEmail(email: string) {}
 
killedBy: maskEmail masks a normal email
statusReason: expected undefined to be 'al***@example.com' // Object.is equality

[Killed] BooleanLiteral
lib/auth.ts:183:7
 
 export function maskEmail(email: string) {
   const [local, domain] = email.split("@");
-  if (!local || !domain) {
+  if (local || !domain) {
     return "hidden";
   }
killedBy: maskEmail masks a normal email
statusReason: expected 'hidden' to be 'al***@example.com' // Object.is equality

[Killed] BlockStatement
lib/auth.ts:183:26
 
 export function maskEmail(email: string) {
   const [local, domain] = email.split("@");
-  if (!local || !domain) {
-    return "hidden";
-  }
+  if (!local || !domain) {}
 
   if (local.length <= 2) {
killedBy: maskEmail returns hidden for email without @
statusReason: expected 'no***@undefined' to be 'hidden' // Object.is equality

[Killed] ConditionalExpression
lib/auth.ts:187:7
     return "hidden";
   }
 
-  if (local.length <= 2) {
+  if (false) {
     return `${local[0] ?? "*"}*@${domain}`;
   }
killedBy: maskEmail masks a short local part (1 char)
statusReason: expected 'a***@example.com' to match /^a\*@example\.com$/

[Killed] ConditionalExpression
lib/auth.ts:187:7
     return "hidden";
   }
 
-  if (local.length <= 2) {
+  if (true) {
     return `${local[0] ?? "*"}*@${domain}`;
   }
killedBy: maskEmail masks a normal email
statusReason: expected 'a*@example.com' to be 'al***@example.com' // Object.is equality

[Killed] LogicalOperator
lib/auth.ts:188:15
   }
 
   if (local.length <= 2) {
-    return `${local[0] ?? "*"}*@${domain}`;
+    return `${local[0] && "*"}*@${domain}`;
   }
 
killedBy: maskEmail masks a short local part (1 char)
statusReason: expected '**@example.com' to match /^a\*@example\.com$/

[Killed] MethodExpression
lib/auth.ts:191:13
     return `${local[0] ?? "*"}*@${domain}`;
   }
 
-  return `${local.slice(0, 2)}***@${domain}`;
+  return `${local}***@${domain}`;
 }
 
killedBy: maskEmail masks a normal email
statusReason: expected 'alice***@example.com' to be 'al***@example.com' // Object.is equality

[Killed] StringLiteral
lib/auth.ts:191:10
     return `${local[0] ?? "*"}*@${domain}`;
   }
 
-  return `${local.slice(0, 2)}***@${domain}`;
+  return ``;
 }
 
killedBy: maskEmail masks a normal email
statusReason: expected '' to be 'al***@example.com' // Object.is equality
