[Killed] BlockStatement
lib/safety.ts:22:39
 const ACTION_PREFIX_REGEX =
   /^(follow|send|schedule|share|prepare|update|create|review|confirm|draft|book|call|email|sync|investigate|deploy|monitor|document|close|assign)\b/i;
 
-function countSentences(text: string) {
-  return text
-    .split(/[.!?]+/)
-    .map((part) => part.trim())
-    .filter(Boolean).length;
-}
+function countSentences(text: string) {}
 
 function hasExplicitRequest(transcript: string) {
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1. Sent 2. Sent 3. Sent 4. Sent …' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Survived] MethodExpression
lib/safety.ts:23:10
   /^(follow|send|schedule|share|prepare|update|create|review|confirm|draft|book|call|email|sync|investigate|deploy|monitor|document|close|assign)\b/i;
 
 function countSentences(text: string) {
-  return text
-    .split(/[.!?]+/)
-    .map((part) => part.trim())
-    .filter(Boolean).length;
+  return text.split(/[.!?]+/).map(part => part.trim()).length;
 }
 

[Killed] ArrowFunction
lib/safety.ts:25:10
 function countSentences(text: string) {
   return text
     .split(/[.!?]+/)
-    .map((part) => part.trim())
+    .map(() => undefined)
     .filter(Boolean).length;
 }
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1. Sent 2. Sent 3. Sent 4. Sent …' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Survived] MethodExpression
lib/safety.ts:25:20
 function countSentences(text: string) {
   return text
     .split(/[.!?]+/)
-    .map((part) => part.trim())
+    .map((part) => part)
     .filter(Boolean).length;
 }

[Killed] BlockStatement
lib/safety.ts:29:49
     .filter(Boolean).length;
 }
 
-function hasExplicitRequest(transcript: string) {
-  return /\b(please|need to|can you|could you|action item|follow up|schedule|send|prepare|share|book|draft|update|assign)\b/i.test(
-    transcript,
-  );
-}
+function hasExplicitRequest(transcript: string) {}
 
 function extractPotentialEntities(text: string) {
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all explicit request keywords
statusReason: expected '' to contain 'no action items were extracted'

[Killed] BlockStatement
lib/safety.ts:35:49
   );
 }
 
-function extractPotentialEntities(text: string) {
-  const matches = text.match(/\b[A-Z][a-z]+ [A-Z][a-z]+\b/g);
-  return (matches ?? []).map((value) => value.toLowerCase());
-}
+function extractPotentialEntities(text: string) {}
 
 function normalizeEmailDraft(emailDraft: string): {
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] LogicalOperator
lib/safety.ts:37:11
 
 function extractPotentialEntities(text: string) {
   const matches = text.match(/\b[A-Z][a-z]+ [A-Z][a-z]+\b/g);
-  return (matches ?? []).map((value) => value.toLowerCase());
+  return (matches && []).map((value) => value.toLowerCase());
 }
 
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: Cannot read properties of null (reading 'map')

[Survived] MethodExpression
lib/safety.ts:37:41
 
 function extractPotentialEntities(text: string) {
   const matches = text.match(/\b[A-Z][a-z]+ [A-Z][a-z]+\b/g);
-  return (matches ?? []).map((value) => value.toLowerCase());
+  return (matches ?? []).map((value) => value.toUpperCase());
 }
 

[Killed] BlockStatement
lib/safety.ts:43:3
 function normalizeEmailDraft(emailDraft: string): {
   emailDraft: string;
   changed: boolean;
-} {
-  let next = emailDraft.trim();
-  let changed = false;
-
-  if (!/^subject:/i.test(next)) {
-    next = `Subject: Transcript Follow-up\n\n${next}`;
-    changed = true;
-  }
-
-  if (!/please review before sending\.?$/im.test(next)) {
-    next = `${next}\n\nPlease review before sending.`;
-    changed = true;
-  }
-
-  return { emailDraft: next, changed };
-}
+} {}
 
 export function runSafetyCheck(input: SafetyInput): SafetyResult {
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Cannot read properties of undefined (reading 'changed')

[Survived] MethodExpression
lib/safety.ts:44:14
   emailDraft: string;
   changed: boolean;
 } {
-  let next = emailDraft.trim();
+  let next = emailDraft;
   let changed = false;
 

[Survived] BooleanLiteral
lib/safety.ts:45:17
   changed: boolean;
 } {
   let next = emailDraft.trim();
-  let changed = false;
+  let changed = true;
 
   if (!/^subject:/i.test(next)) {

[Killed] BlockStatement
lib/safety.ts:47:33
   let next = emailDraft.trim();
   let changed = false;
 
-  if (!/^subject:/i.test(next)) {
-    next = `Subject: Transcript Follow-up\n\n${next}`;
-    changed = true;
-  }
+  if (!/^subject:/i.test(next)) {}
 
   if (!/please review before sending\.?$/im.test(next)) {
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected '\n\nPlease review before sending.' to contain 'Subject:'

[Killed] BooleanLiteral
lib/safety.ts:47:7
   let next = emailDraft.trim();
   let changed = false;
 
-  if (!/^subject:/i.test(next)) {
+  if (/^subject:/i.test(next)) {
     next = `Subject: Transcript Follow-up\n\n${next}`;
     changed = true;
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected '\n\nPlease review before sending.' to contain 'Subject:'

[Survived] BooleanLiteral
lib/safety.ts:49:15
 
   if (!/^subject:/i.test(next)) {
     next = `Subject: Transcript Follow-up\n\n${next}`;
-    changed = true;
+    changed = false;
   }
 

[Killed] BlockStatement
lib/safety.ts:52:57
     changed = true;
   }
 
-  if (!/please review before sending\.?$/im.test(next)) {
-    next = `${next}\n\nPlease review before sending.`;
-    changed = true;
-  }
+  if (!/please review before sending\.?$/im.test(next)) {}
 
   return { emailDraft: next, changed };
killedBy: runSafetyCheck passes valid grounded output and adds footer when missing
statusReason: expected 'Subject: Status Follow-up\n\nDraft bo…' to contain 'Please review before sending.'

[Killed] ConditionalExpression
lib/safety.ts:52:7
     changed = true;
   }
 
-  if (!/please review before sending\.?$/im.test(next)) {
+  if (false) {
     next = `${next}\n\nPlease review before sending.`;
     changed = true;
killedBy: runSafetyCheck passes valid grounded output and adds footer when missing
statusReason: expected 'Subject: Status Follow-up\n\nDraft bo…' to contain 'Please review before sending.'

[Survived] BooleanLiteral
lib/safety.ts:54:15
 
   if (!/please review before sending\.?$/im.test(next)) {
     next = `${next}\n\nPlease review before sending.`;
-    changed = true;
+    changed = false;
   }
 

[Survived] BooleanLiteral
lib/safety.ts:62:22
 
 export function runSafetyCheck(input: SafetyInput): SafetyResult {
   const issues: string[] = [];
-  let fallbackUsed = false;
+  let fallbackUsed = true;
 
   const transcript = input.transcript.trim();

[Survived] MethodExpression
lib/safety.ts:64:22
   const issues: string[] = [];
   let fallbackUsed = false;
 
-  const transcript = input.transcript.trim();
+  const transcript = input.transcript;
   let summary = input.summary.trim();
   let taskList = input.taskList.map((item) => item.trim()).filter(Boolean);

[Survived] MethodExpression
lib/safety.ts:65:17
   let fallbackUsed = false;
 
   const transcript = input.transcript.trim();
-  let summary = input.summary.trim();
+  let summary = input.summary;
   let taskList = input.taskList.map((item) => item.trim()).filter(Boolean);
   const emailNormalized = normalizeEmailDraft(input.emailDraft);

[Killed] ArrowFunction
lib/safety.ts:66:37
 
   const transcript = input.transcript.trim();
   let summary = input.summary.trim();
-  let taskList = input.taskList.map((item) => item.trim()).filter(Boolean);
+  let taskList = input.taskList.map(() => undefined).filter(Boolean);
   const emailNormalized = normalizeEmailDraft(input.emailDraft);
 
killedBy: /api/process response contract preserves top-level key contract
statusReason: Safety check failed: Transcript contains explicit requests but no action items were extracted.

[Survived] MethodExpression
lib/safety.ts:66:47
 
   const transcript = input.transcript.trim();
   let summary = input.summary.trim();
-  let taskList = input.taskList.map((item) => item.trim()).filter(Boolean);
+  let taskList = input.taskList.map((item) => item).filter(Boolean);
   const emailNormalized = normalizeEmailDraft(input.emailDraft);
 

[Survived] BlockStatement
lib/safety.ts:69:32
   let taskList = input.taskList.map((item) => item.trim()).filter(Boolean);
   const emailNormalized = normalizeEmailDraft(input.emailDraft);
 
-  if (emailNormalized.changed) {
-    fallbackUsed = true;
-  }
+  if (emailNormalized.changed) {}
 
   if (!transcript) {

[Survived] ConditionalExpression
lib/safety.ts:69:7
   let taskList = input.taskList.map((item) => item.trim()).filter(Boolean);
   const emailNormalized = normalizeEmailDraft(input.emailDraft);
 
-  if (emailNormalized.changed) {
+  if (true) {
     fallbackUsed = true;
   }

[Survived] BooleanLiteral
lib/safety.ts:70:20
   const emailNormalized = normalizeEmailDraft(input.emailDraft);
 
   if (emailNormalized.changed) {
-    fallbackUsed = true;
+    fallbackUsed = false;
   }
 

[Killed] ConditionalExpression
lib/safety.ts:73:7
     fallbackUsed = true;
   }
 
-  if (!transcript) {
+  if (true) {
     issues.push("Transcript is empty.");
   }
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Safety check failed: Transcript is empty.

[Killed] BlockStatement
lib/safety.ts:73:20
     fallbackUsed = true;
   }
 
-  if (!transcript) {
-    issues.push("Transcript is empty.");
-  }
+  if (!transcript) {}
 
   if (!summary) {
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected [ 'Summary is empty.' ] to include 'Transcript is empty.'

[Killed] ConditionalExpression
lib/safety.ts:77:7
     issues.push("Transcript is empty.");
   }
 
-  if (!summary) {
+  if (false) {
     issues.push("Summary is empty.");
   }
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected [ 'Transcript is empty.' ] to include 'Summary is empty.'

[Killed] BooleanLiteral
lib/safety.ts:77:7
     issues.push("Transcript is empty.");
   }
 
-  if (!summary) {
+  if (summary) {
     issues.push("Summary is empty.");
   }
killedBy: /api/process response contract preserves top-level key contract
statusReason: Safety check failed: Summary is empty.

[Killed] ConditionalExpression
lib/safety.ts:82:7
   }
 
   const sentenceCount = countSentences(summary);
-  if (sentenceCount > 3) {
+  if (false) {
     summary = summary
       .split(/(?<=[.!?])\s+/)
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1. Sent 2. Sent 3. Sent 4. Sent …' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Killed] EqualityOperator
lib/safety.ts:82:7
   }
 
   const sentenceCount = countSentences(summary);
-  if (sentenceCount > 3) {
+  if (sentenceCount <= 3) {
     summary = summary
       .split(/(?<=[.!?])\s+/)
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1. Sent 2. Sent 3. Sent 4. Sent …' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Killed] MethodExpression
lib/safety.ts:83:15
 
   const sentenceCount = countSentences(summary);
   if (sentenceCount > 3) {
-    summary = summary
-      .split(/(?<=[.!?])\s+/)
-      .slice(0, 3)
+    summary = summary.split(/(?<=[.!?])\s+/)
       .join(" ")
       .trim();
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1. Sent 2. Sent 3. Sent 4. Sent …' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Survived] MethodExpression
lib/safety.ts:83:15
 
   const sentenceCount = countSentences(summary);
   if (sentenceCount > 3) {
-    summary = summary
-      .split(/(?<=[.!?])\s+/)
-      .slice(0, 3)
-      .join(" ")
-      .trim();
+    summary = summary.split(/(?<=[.!?])\s+/).slice(0, 3).join(" ");
     fallbackUsed = true;
   }

[Killed] Regex
lib/safety.ts:84:14
   const sentenceCount = countSentences(summary);
   if (sentenceCount > 3) {
     summary = summary
-      .split(/(?<=[.!?])\s+/)
+      .split(/(?<=[^.!?])\s+/)
       .slice(0, 3)
       .join(" ")
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1. Sent 2. Sent' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Killed] Regex
lib/safety.ts:84:14
   const sentenceCount = countSentences(summary);
   if (sentenceCount > 3) {
     summary = summary
-      .split(/(?<=[.!?])\s+/)
+      .split(/(?<![.!?])\s+/)
       .slice(0, 3)
       .join(" ")
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1. Sent 2. Sent' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Killed] StringLiteral
lib/safety.ts:86:13
     summary = summary
       .split(/(?<=[.!?])\s+/)
       .slice(0, 3)
-      .join(" ")
+      .join("")
       .trim();
     fallbackUsed = true;
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'Sent 1.Sent 2.Sent 3.' to be 'Sent 1. Sent 2. Sent 3.' // Object.is equality

[Killed] BooleanLiteral
lib/safety.ts:88:20
       .slice(0, 3)
       .join(" ")
       .trim();
-    fallbackUsed = true;
+    fallbackUsed = false;
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/safety.ts:91:37
     fallbackUsed = true;
   }
 
-  taskList = taskList.map((item) => {
-    let normalized = item;
-
-    if (normalized.length > 140) {
-      normalized = `${normalized.slice(0, 137).trim()}...`;
-      fallbackUsed = true;
-    }
-
-    if (!ACTION_PREFIX_REGEX.test(normalized)) {
-      normalized = `Follow up: ${normalized}`;
-      fallbackUsed = true;
-    }
-
-    return normalized;
-  });
+  taskList = taskList.map((item) => {});
 
   if (hasExplicitRequest(transcript) && taskList.length < 1) {
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
lib/safety.ts:94:34
   taskList = taskList.map((item) => {
     let normalized = item;
 
-    if (normalized.length > 140) {
-      normalized = `${normalized.slice(0, 137).trim()}...`;
-      fallbackUsed = true;
-    }
+    if (normalized.length > 140) {}
 
     if (!ACTION_PREFIX_REGEX.test(normalized)) {
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 150 to be 140 // Object.is equality

[Killed] ConditionalExpression
lib/safety.ts:94:9
   taskList = taskList.map((item) => {
     let normalized = item;
 
-    if (normalized.length > 140) {
+    if (false) {
       normalized = `${normalized.slice(0, 137).trim()}...`;
       fallbackUsed = true;
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 150 to be 140 // Object.is equality

[Killed] MethodExpression
lib/safety.ts:95:23
     let normalized = item;
 
     if (normalized.length > 140) {
-      normalized = `${normalized.slice(0, 137).trim()}...`;
+      normalized = `${normalized.trim()}...`;
       fallbackUsed = true;
     }
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 153 to be 140 // Object.is equality

[Survived] MethodExpression
lib/safety.ts:95:23
     let normalized = item;
 
     if (normalized.length > 140) {
-      normalized = `${normalized.slice(0, 137).trim()}...`;
+      normalized = `${normalized.slice(0, 137)}...`;
       fallbackUsed = true;
     }

[Survived] BooleanLiteral
lib/safety.ts:96:22
 
     if (normalized.length > 140) {
       normalized = `${normalized.slice(0, 137).trim()}...`;
-      fallbackUsed = true;
+      fallbackUsed = false;
     }
 

[Killed] ConditionalExpression
lib/safety.ts:99:9
       fallbackUsed = true;
     }
 
-    if (!ACTION_PREFIX_REGEX.test(normalized)) {
+    if (true) {
       normalized = `Follow up: ${normalized}`;
       fallbackUsed = true;
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 151 to be 140 // Object.is equality

[Killed] BlockStatement
lib/safety.ts:99:48
       fallbackUsed = true;
     }
 
-    if (!ACTION_PREFIX_REGEX.test(normalized)) {
-      normalized = `Follow up: ${normalized}`;
-      fallbackUsed = true;
-    }
+    if (!ACTION_PREFIX_REGEX.test(normalized)) {}
 
     return normalized;
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected 'no prefix' to be 'Follow up: no prefix' // Object.is equality

[Killed] StringLiteral
lib/safety.ts:100:20
     }
 
     if (!ACTION_PREFIX_REGEX.test(normalized)) {
-      normalized = `Follow up: ${normalized}`;
+      normalized = ``;
       fallbackUsed = true;
     }
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected '' to be 'Follow up: no prefix' // Object.is equality

[Survived] BooleanLiteral
lib/safety.ts:101:22
 
     if (!ACTION_PREFIX_REGEX.test(normalized)) {
       normalized = `Follow up: ${normalized}`;
-      fallbackUsed = true;
+      fallbackUsed = false;
     }
 

[Killed] ConditionalExpression
lib/safety.ts:107:41
     return normalized;
   });
 
-  if (hasExplicitRequest(transcript) && taskList.length < 1) {
+  if (hasExplicitRequest(transcript) && true) {
     issues.push("Transcript contains explicit requests but no action items were extracted.");
   }
killedBy: processPayload returns success payload with required meta and steps
statusReason: Safety check failed: Transcript contains explicit requests but no action items were extracted.

[Killed] ConditionalExpression
lib/safety.ts:107:7
     return normalized;
   });
 
-  if (hasExplicitRequest(transcript) && taskList.length < 1) {
+  if (true) {
     issues.push("Transcript contains explicit requests but no action items were extracted.");
   }
killedBy: processPayload returns success payload with required meta and steps
statusReason: Safety check failed: Transcript contains explicit requests but no action items were extracted.

[Killed] StringLiteral
lib/safety.ts:108:17
   });
 
   if (hasExplicitRequest(transcript) && taskList.length < 1) {
-    issues.push("Transcript contains explicit requests but no action items were extracted.");
+    issues.push("");
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all explicit request keywords
statusReason: expected '' to contain 'no action items were extracted'

[Survived] StringLiteral
lib/safety.ts:112:63
   }
 
   const transcriptEntities = new Set(extractPotentialEntities(transcript));
-  const taskEntities = extractPotentialEntities(taskList.join("\n"));
+  const taskEntities = extractPotentialEntities(taskList.join(""));
 
   const foreignEntities = taskEntities.filter(

[Survived] MethodExpression
lib/safety.ts:114:27
   const transcriptEntities = new Set(extractPotentialEntities(transcript));
   const taskEntities = extractPotentialEntities(taskList.join("\n"));
 
-  const foreignEntities = taskEntities.filter(
-    (entity) => !transcriptEntities.has(entity),
-  );
+  const foreignEntities = taskEntities;
 
   if (foreignEntities.length > 0) {

[Killed] BooleanLiteral
lib/safety.ts:115:17
   const taskEntities = extractPotentialEntities(taskList.join("\n"));
 
   const foreignEntities = taskEntities.filter(
-    (entity) => !transcriptEntities.has(entity),
+    (entity) => transcriptEntities.has(entity),
   );
 
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected [] to include 'Action items may introduce entities n…'

[Killed] ArrowFunction
lib/safety.ts:115:5
   const taskEntities = extractPotentialEntities(taskList.join("\n"));
 
   const foreignEntities = taskEntities.filter(
-    (entity) => !transcriptEntities.has(entity),
+    () => undefined,
   );
 
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected [] to include 'Action items may introduce entities n…'

[Killed] ConditionalExpression
lib/safety.ts:118:7
     (entity) => !transcriptEntities.has(entity),
   );
 
-  if (foreignEntities.length > 0) {
+  if (true) {
     issues.push("Action items may introduce entities not present in the transcript.");
   }
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Safety check failed: Action items may introduce entities not present in the transcript.

[Killed] EqualityOperator
lib/safety.ts:118:7
     (entity) => !transcriptEntities.has(entity),
   );
 
-  if (foreignEntities.length > 0) {
+  if (foreignEntities.length <= 0) {
     issues.push("Action items may introduce entities not present in the transcript.");
   }
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Safety check failed: Action items may introduce entities not present in the transcript.

[Killed] StringLiteral
lib/safety.ts:119:17
   );
 
   if (foreignEntities.length > 0) {
-    issues.push("Action items may introduce entities not present in the transcript.");
+    issues.push("");
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected [ '' ] to include 'Action items may introduce entities n…'

[Killed] ConditionalExpression
lib/safety.ts:122:7
     issues.push("Action items may introduce entities not present in the transcript.");
   }
 
-  if (!emailNormalized.emailDraft.trim()) {
+  if (true) {
     issues.push("Email draft is empty.");
   }
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Safety check failed: Email draft is empty.

[Killed] BooleanLiteral
lib/safety.ts:122:7
     issues.push("Action items may introduce entities not present in the transcript.");
   }
 
-  if (!emailNormalized.emailDraft.trim()) {
+  if (emailNormalized.emailDraft.trim()) {
     issues.push("Email draft is empty.");
   }
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Safety check failed: Email draft is empty.

[NoCoverage] StringLiteral
lib/safety.ts:123:17
   }
 
   if (!emailNormalized.emailDraft.trim()) {
-    issues.push("Email draft is empty.");
+    issues.push("");
   }
 

[Killed] ObjectLiteral
lib/safety.ts:126:10
     issues.push("Email draft is empty.");
   }
 
-  return {
-    ok: issues.length === 0,
-    fallbackUsed,
-    issues,
-    normalized: {
-      summary,
-      taskList,
-      emailDraft: emailNormalized.emailDraft,
-    },
-  };
+  return {};
 }
 
killedBy: ScanLedger: 100% Coverage Suite lib/safety.ts hits all safety normalization and edge cases
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
lib/safety.ts:127:9
   }
 
   return {
-    ok: issues.length === 0,
+    ok: issues.length !== 0,
     fallbackUsed,
     issues,
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Safety check failed:

[Killed] ConditionalExpression
lib/safety.ts:127:9
   }
 
   return {
-    ok: issues.length === 0,
+    ok: false,
     fallbackUsed,
     issues,
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Safety check failed:
