[Survived] BlockStatement
lib/rateLimit.ts:15:55
  * internet an attacker can spoof x-forwarded-for to bypass rate limiting.
  * Do NOT use this in deployments without a trusted, header-stripping proxy.
  */
-export function getClientIp(request: Request): string {
-  const forwarded = request.headers.get("x-forwarded-for");
-  if (forwarded) {
-    // Take the leftmost (original client) IP from the comma-separated list.
-    return forwarded.split(",")[0].trim();
-  }
-
-  const realIp = request.headers.get("x-real-ip");
-  if (realIp) {
-    return realIp;
-  }
-
-  return "unknown";
-}
+export function getClientIp(request: Request): string {}
 
 export async function checkRateLimit(

[Killed] ConditionalExpression
lib/rateLimit.ts:17:7
  */
 export function getClientIp(request: Request): string {
   const forwarded = request.headers.get("x-forwarded-for");
-  if (forwarded) {
+  if (true) {
     // Take the leftmost (original client) IP from the comma-separated list.
     return forwarded.split(",")[0].trim();
killedBy: POST /api/process rejects bad JSON
statusReason: Cannot read properties of null (reading 'split')

[NoCoverage] BlockStatement
lib/rateLimit.ts:17:18
  */
 export function getClientIp(request: Request): string {
   const forwarded = request.headers.get("x-forwarded-for");
-  if (forwarded) {
-    // Take the leftmost (original client) IP from the comma-separated list.
-    return forwarded.split(",")[0].trim();
-  }
+  if (forwarded) {}
 
   const realIp = request.headers.get("x-real-ip");

[NoCoverage] MethodExpression
lib/rateLimit.ts:19:12
   const forwarded = request.headers.get("x-forwarded-for");
   if (forwarded) {
     // Take the leftmost (original client) IP from the comma-separated list.
-    return forwarded.split(",")[0].trim();
+    return forwarded.split(",")[0];
   }
 

[Killed] StringLiteral
lib/rateLimit.ts:22:38
     return forwarded.split(",")[0].trim();
   }
 
-  const realIp = request.headers.get("x-real-ip");
+  const realIp = request.headers.get("");
   if (realIp) {
     return realIp;
killedBy: POST /api/process rejects bad JSON
statusReason: Headers.get: "" is an invalid header name.

[Survived] ConditionalExpression
lib/rateLimit.ts:23:7
   }
 
   const realIp = request.headers.get("x-real-ip");
-  if (realIp) {
+  if (true) {
     return realIp;
   }

[Survived] BlockStatement
lib/rateLimit.ts:23:15
   }
 
   const realIp = request.headers.get("x-real-ip");
-  if (realIp) {
-    return realIp;
-  }
+  if (realIp) {}
 
   return "unknown";

[Killed] BlockStatement
lib/rateLimit.ts:34:29
   clientKey: string,
   maxRequestsPerMinute: number,
   burstRequestsPer10s = 6,
-): Promise<RateLimitResult> {
-  return getRuntimeStateAdapter().checkRateLimit(
-    clientKey,
-    maxRequestsPerMinute,
-    burstRequestsPer10s,
-  );
-}
+): Promise<RateLimitResult> {}
 
 export function resetRateLimiterForTests() {
killedBy: POST /api/process rejects bad JSON
statusReason: expected 500 to be 400 // Object.is equality

[Survived] BlockStatement
lib/rateLimit.ts:42:44
   );
 }
 
-export function resetRateLimiterForTests() {
-  resetMemoryRuntimeStateForTests();
-}
+export function resetRateLimiterForTests() {}
 
