[Killed] ObjectLiteral
lib/rbac.ts:5:48
 
 import type { SessionData, SessionRole } from "@/lib/auth";
 
-const ROLE_RANK: Record<SessionRole, number> = {
-  viewer: 0,
-  agent: 1,
-  admin: 2,
-  owner: 3,
-};
+const ROLE_RANK: Record<SessionRole, number> = {};
 
 export function hasRole(
killedBy: hasRole owner satisfies all roles
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/rbac.ts:15:3
 export function hasRole(
   currentRole: SessionRole,
   requiredRoles: SessionRole[],
-) {
-  const currentRank = ROLE_RANK[currentRole] ?? 0;
-  return requiredRoles.some((role) => currentRank >= ROLE_RANK[role]);
-}
+) {}
 
 export function forbiddenResponse(requestId: string, detailsCode = "RBAC_FORBIDDEN") {
killedBy: POST /api/process rejects bad JSON
statusReason: expected 403 to be 400 // Object.is equality

[Killed] LogicalOperator
lib/rbac.ts:16:23
   currentRole: SessionRole,
   requiredRoles: SessionRole[],
 ) {
-  const currentRank = ROLE_RANK[currentRole] ?? 0;
+  const currentRank = ROLE_RANK[currentRole] && 0;
   return requiredRoles.some((role) => currentRank >= ROLE_RANK[role]);
 }
killedBy: POST /api/process rejects bad JSON
statusReason: expected 403 to be 400 // Object.is equality

[Killed] ConditionalExpression
lib/rbac.ts:17:39
   requiredRoles: SessionRole[],
 ) {
   const currentRank = ROLE_RANK[currentRole] ?? 0;
-  return requiredRoles.some((role) => currentRank >= ROLE_RANK[role]);
+  return requiredRoles.some((role) => false);
 }
 
killedBy: POST /api/process rejects bad JSON
statusReason: expected 403 to be 400 // Object.is equality

[Killed] ArrowFunction
lib/rbac.ts:17:29
   requiredRoles: SessionRole[],
 ) {
   const currentRank = ROLE_RANK[currentRole] ?? 0;
-  return requiredRoles.some((role) => currentRank >= ROLE_RANK[role]);
+  return requiredRoles.some(() => undefined);
 }
 
killedBy: POST /api/process rejects bad JSON
statusReason: expected 403 to be 400 // Object.is equality

[Killed] BlockStatement
lib/rbac.ts:20:86
   return requiredRoles.some((role) => currentRank >= ROLE_RANK[role]);
 }
 
-export function forbiddenResponse(requestId: string, detailsCode = "RBAC_FORBIDDEN") {
-  return NextResponse.json(
-    {
-      error: {
-        code: "FORBIDDEN",
-        detailsCode,
-        message: "You do not have permission for this action.",
-        requestId,
-      },
-    },
-    { status: 403 },
-  );
-}
+export function forbiddenResponse(requestId: string, detailsCode = "RBAC_FORBIDDEN") {}
 
 export function ensureRole(
killedBy: forbiddenResponse returns 403 with default code
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ObjectLiteral
lib/rbac.ts:22:5
 
 export function forbiddenResponse(requestId: string, detailsCode = "RBAC_FORBIDDEN") {
   return NextResponse.json(
-    {
-      error: {
-        code: "FORBIDDEN",
-        detailsCode,
-        message: "You do not have permission for this action.",
-        requestId,
-      },
-    },
+    {},
     { status: 403 },
   );
killedBy: forbiddenResponse returns 403 with default code
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
lib/rbac.ts:39:3
   requiredRoles: SessionRole[],
   requestId: string,
   detailsCode?: string,
-) {
-  if (!hasRole(session.role, requiredRoles)) {
-    return forbiddenResponse(requestId, detailsCode);
-  }
-
-  return null;
-}
+) {}
 
killedBy: ensureRole returns null when session has sufficient role
statusReason: expected undefined to be null

[Killed] BooleanLiteral
lib/rbac.ts:40:7
   requestId: string,
   detailsCode?: string,
 ) {
-  if (!hasRole(session.role, requiredRoles)) {
+  if (hasRole(session.role, requiredRoles)) {
     return forbiddenResponse(requestId, detailsCode);
   }
killedBy: ensureRole returns null when session has sufficient role
statusReason: expected Response { status: 403, statusText: '', headers: Headers { 'content-type': 'application/json' }, body: ReadableStream { locked: false, state: 'readable', supportsBYOB: true }, bodyUsed: false, ok: false, redirected: false, type: 'default', url: '' } to be null

[Killed] ConditionalExpression
lib/rbac.ts:40:7
   requestId: string,
   detailsCode?: string,
 ) {
-  if (!hasRole(session.role, requiredRoles)) {
+  if (true) {
     return forbiddenResponse(requestId, detailsCode);
   }
killedBy: ensureRole returns null when session has sufficient role
statusReason: expected Response { status: 403, statusText: '', headers: Headers { 'content-type': 'application/json' }, body: ReadableStream { locked: false, state: 'readable', supportsBYOB: true }, bodyUsed: false, ok: false, redirected: false, type: 'default', url: '' } to be null
