[Killed] BlockStatement
lib/ssrf.ts:8:32
   | { ok: true; url: URL }
   | { ok: false; reason: string };
 
-function parseAllowlistHosts() {
-  const configured = process.env.WEBHOOK_ALLOWLIST_HOSTS;
-  if (!configured?.trim()) {
-    return new Set<string>();
-  }
-
-  return new Set(
-    configured
-      .split(",")
-      .map((entry) => entry.trim().toLowerCase())
-      .filter(Boolean),
-  );
-}
+function parseAllowlistHosts() {}
 
 function isAllowlistedHost(hostname: string, allowlistHosts: Set<string>) {
killedBy: ssrf validator blocks localhost and private ranges
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] ConditionalExpression
lib/ssrf.ts:10:7
 
 function parseAllowlistHosts() {
   const configured = process.env.WEBHOOK_ALLOWLIST_HOSTS;
-  if (!configured?.trim()) {
+  if (true) {
     return new Set<string>();
   }
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/ssrf.ts:10:7
 
 function parseAllowlistHosts() {
   const configured = process.env.WEBHOOK_ALLOWLIST_HOSTS;
-  if (!configured?.trim()) {
+  if (configured?.trim()) {
     return new Set<string>();
   }
killedBy: ssrf validator blocks localhost and private ranges
statusReason: Cannot read properties of undefined (reading 'split')

[Survived] MethodExpression
lib/ssrf.ts:15:5
   }
 
   return new Set(
-    configured
-      .split(",")
-      .map((entry) => entry.trim().toLowerCase())
-      .filter(Boolean),
+    configured.split(",").map(entry => entry.trim().toLowerCase()),
   );
 }

[Killed] MethodExpression
lib/ssrf.ts:17:23
   return new Set(
     configured
       .split(",")
-      .map((entry) => entry.trim().toLowerCase())
+      .map((entry) => entry.toLowerCase())
       .filter(Boolean),
   );
killedBy: ssrf validator allowlist with spaces and mixed case is normalised
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] ArrowFunction
lib/ssrf.ts:17:12
   return new Set(
     configured
       .split(",")
-      .map((entry) => entry.trim().toLowerCase())
+      .map(() => undefined)
       .filter(Boolean),
   );
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/ssrf.ts:22:75
   );
 }
 
-function isAllowlistedHost(hostname: string, allowlistHosts: Set<string>) {
-  if (allowlistHosts.size === 0) {
-    return true;
-  }
-
-  if (allowlistHosts.has(hostname)) {
-    return true;
-  }
-
-  return [...allowlistHosts].some((allowed) => hostname.endsWith(`.${allowed}`));
-}
+function isAllowlistedHost(hostname: string, allowlistHosts: Set<string>) {}
 
 function isPrivateIpv4(address: string) {
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/ssrf.ts:23:7
 }
 
 function isAllowlistedHost(hostname: string, allowlistHosts: Set<string>) {
-  if (allowlistHosts.size === 0) {
+  if (true) {
     return true;
   }
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/ssrf.ts:23:7
 }
 
 function isAllowlistedHost(hostname: string, allowlistHosts: Set<string>) {
-  if (allowlistHosts.size === 0) {
+  if (false) {
     return true;
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:24:12
 
 function isAllowlistedHost(hostname: string, allowlistHosts: Set<string>) {
   if (allowlistHosts.size === 0) {
-    return true;
+    return false;
   }
 
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/ssrf.ts:27:7
     return true;
   }
 
-  if (allowlistHosts.has(hostname)) {
+  if (false) {
     return true;
   }
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/ssrf.ts:27:37
     return true;
   }
 
-  if (allowlistHosts.has(hostname)) {
-    return true;
-  }
+  if (allowlistHosts.has(hostname)) {}
 
   return [...allowlistHosts].some((allowed) => hostname.endsWith(`.${allowed}`));
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
lib/ssrf.ts:28:12
   }
 
   if (allowlistHosts.has(hostname)) {
-    return true;
+    return false;
   }
 
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
lib/ssrf.ts:31:35
     return true;
   }
 
-  return [...allowlistHosts].some((allowed) => hostname.endsWith(`.${allowed}`));
+  return [...allowlistHosts].some(() => undefined);
 }
 
killedBy: ssrf validator allows subdomain of allowlisted host
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
lib/ssrf.ts:31:48
     return true;
   }
 
-  return [...allowlistHosts].some((allowed) => hostname.endsWith(`.${allowed}`));
+  return [...allowlistHosts].some((allowed) => hostname.startsWith(`.${allowed}`));
 }
 
killedBy: ssrf validator allows subdomain of allowlisted host
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
lib/ssrf.ts:35:40
 }
 
 function isPrivateIpv4(address: string) {
-  const parts = address.split(".").map((part) => Number.parseInt(part, 10));
+  const parts = address.split(".").map(() => undefined);
   if (parts.length !== 4 || parts.some((part) => Number.isNaN(part))) {
     return true;
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/ssrf.ts:36:7
 
 function isPrivateIpv4(address: string) {
   const parts = address.split(".").map((part) => Number.parseInt(part, 10));
-  if (parts.length !== 4 || parts.some((part) => Number.isNaN(part))) {
+  if (true) {
     return true;
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:36:7
 
 function isPrivateIpv4(address: string) {
   const parts = address.split(".").map((part) => Number.parseInt(part, 10));
-  if (parts.length !== 4 || parts.some((part) => Number.isNaN(part))) {
+  if (parts.length === 4 || parts.some((part) => Number.isNaN(part))) {
     return true;
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[NoCoverage] BooleanLiteral
lib/ssrf.ts:37:12
 function isPrivateIpv4(address: string) {
   const parts = address.split(".").map((part) => Number.parseInt(part, 10));
   if (parts.length !== 4 || parts.some((part) => Number.isNaN(part))) {
-    return true;
+    return false;
   }
 

[Killed] LogicalOperator
lib/ssrf.ts:41:7
   }
 
   const [a, b] = parts;
-  if (a === 10 || a === 127 || a === 0) {
+  if ((a === 10 || a === 127) && a === 0) {
     return true;
   }
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/ssrf.ts:41:32
   }
 
   const [a, b] = parts;
-  if (a === 10 || a === 127 || a === 0) {
+  if (a === 10 || a === 127 || a !== 0) {
     return true;
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:42:12
 
   const [a, b] = parts;
   if (a === 10 || a === 127 || a === 0) {
-    return true;
+    return false;
   }
   if (a === 100 && b >= 64 && b <= 127) {
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
lib/ssrf.ts:44:7
   if (a === 10 || a === 127 || a === 0) {
     return true;
   }
-  if (a === 100 && b >= 64 && b <= 127) {
+  if (a === 100 || b >= 64 && b <= 127) {
     return true;
   }
killedBy: ssrf validator allows 100.63.x.x — just below CGNAT range (public boundary)
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:44:20
   if (a === 10 || a === 127 || a === 0) {
     return true;
   }
-  if (a === 100 && b >= 64 && b <= 127) {
+  if (a === 100 && b < 64 && b <= 127) {
     return true;
   }
killedBy: ssrf validator blocks 100.64.x.x — lower CGNAT boundary
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:45:12
     return true;
   }
   if (a === 100 && b >= 64 && b <= 127) {
-    return true;
+    return false;
   }
   if (a === 169 && b === 254) {
killedBy: ssrf validator blocks 100.64.x.x — lower CGNAT boundary
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:47:7
   if (a === 100 && b >= 64 && b <= 127) {
     return true;
   }
-  if (a === 169 && b === 254) {
+  if (a !== 169 && b === 254) {
     return true;
   }
killedBy: ssrf validator blocks 169.254.x.x link-local — boundary
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/ssrf.ts:47:7
   if (a === 100 && b >= 64 && b <= 127) {
     return true;
   }
-  if (a === 169 && b === 254) {
+  if (true) {
     return true;
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:48:12
     return true;
   }
   if (a === 169 && b === 254) {
-    return true;
+    return false;
   }
   if (a === 172 && b >= 16 && b <= 31) {
killedBy: ssrf validator blocks 169.254.x.x link-local — boundary
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] LogicalOperator
lib/ssrf.ts:50:7
   if (a === 169 && b === 254) {
     return true;
   }
-  if (a === 172 && b >= 16 && b <= 31) {
+  if (a === 172 && b >= 16 || b <= 31) {
     return true;
   }
killedBy: ssrf validator blocks 172.15.x.x — just below private range (public boundary)
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:50:31
   if (a === 169 && b === 254) {
     return true;
   }
-  if (a === 172 && b >= 16 && b <= 31) {
+  if (a === 172 && b >= 16 && b > 31) {
     return true;
   }
killedBy: ssrf validator blocks 172.16-31.x.x private range — boundary values
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:51:12
     return true;
   }
   if (a === 172 && b >= 16 && b <= 31) {
-    return true;
+    return false;
   }
   if (a === 192 && b === 168) {
killedBy: ssrf validator blocks 172.16-31.x.x private range — boundary values
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:53:7
   if (a === 172 && b >= 16 && b <= 31) {
     return true;
   }
-  if (a === 192 && b === 168) {
+  if (a !== 192 && b === 168) {
     return true;
   }
killedBy: ssrf validator blocks 192.168.x.x private range
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:53:20
   if (a === 172 && b >= 16 && b <= 31) {
     return true;
   }
-  if (a === 192 && b === 168) {
+  if (a === 192 && b !== 168) {
     return true;
   }
killedBy: ssrf validator blocks 192.168.x.x private range
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:54:12
     return true;
   }
   if (a === 192 && b === 168) {
-    return true;
+    return false;
   }
   if (a === 192 && b === 0) {
killedBy: ssrf validator blocks 192.168.x.x private range
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] LogicalOperator
lib/ssrf.ts:56:7
   if (a === 192 && b === 168) {
     return true;
   }
-  if (a === 192 && b === 0) {
+  if (a === 192 || b === 0) {
     return true;
   }
killedBy: ssrf validator allows 223.x.x.x — just below multicast (public boundary)
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/ssrf.ts:56:7
   if (a === 192 && b === 168) {
     return true;
   }
-  if (a === 192 && b === 0) {
+  if (true) {
     return true;
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[NoCoverage] BooleanLiteral
lib/ssrf.ts:57:12
     return true;
   }
   if (a === 192 && b === 0) {
-    return true;
+    return false;
   }
   if (a === 198 && (b === 18 || b === 19)) {

[Killed] ConditionalExpression
lib/ssrf.ts:59:21
   if (a === 192 && b === 0) {
     return true;
   }
-  if (a === 198 && (b === 18 || b === 19)) {
+  if (a === 198 && (false || b === 19)) {
     return true;
   }
killedBy: ssrf validator blocks 198.18.x.x and 198.19.x.x — benchmark range
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] LogicalOperator
lib/ssrf.ts:59:7
   if (a === 192 && b === 0) {
     return true;
   }
-  if (a === 198 && (b === 18 || b === 19)) {
+  if (a === 198 || b === 18 || b === 19) {
     return true;
   }
killedBy: ssrf validator allows 198.17.x.x — just below benchmark range (public)
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:60:12
     return true;
   }
   if (a === 198 && (b === 18 || b === 19)) {
-    return true;
+    return false;
   }
   if (a >= 224) {
killedBy: ssrf validator blocks 198.18.x.x and 198.19.x.x — benchmark range
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/ssrf.ts:62:17
   if (a === 198 && (b === 18 || b === 19)) {
     return true;
   }
-  if (a >= 224) {
-    return true;
-  }
+  if (a >= 224) {}
   return false;
 }
killedBy: ssrf validator blocks multicast 224.0.0.1 — lower boundary
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/ssrf.ts:62:7
   if (a === 198 && (b === 18 || b === 19)) {
     return true;
   }
-  if (a >= 224) {
+  if (true) {
     return true;
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:63:12
     return true;
   }
   if (a >= 224) {
-    return true;
+    return false;
   }
   return false;
killedBy: ssrf validator blocks multicast 224.0.0.1 — lower boundary
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[NoCoverage] MethodExpression
lib/ssrf.ts:69:22
 }
 
 function isPrivateIpv6(address: string) {
-  const normalized = address.toLowerCase();
+  const normalized = address.toUpperCase();
   if (normalized === "::1" || normalized === "::") {
     return true;

[NoCoverage] ConditionalExpression
lib/ssrf.ts:70:7
 
 function isPrivateIpv6(address: string) {
   const normalized = address.toLowerCase();
-  if (normalized === "::1" || normalized === "::") {
+  if (false) {
     return true;
   }

[NoCoverage] ConditionalExpression
lib/ssrf.ts:70:7
 
 function isPrivateIpv6(address: string) {
   const normalized = address.toLowerCase();
-  if (normalized === "::1" || normalized === "::") {
+  if (false || normalized === "::") {
     return true;
   }

[NoCoverage] BooleanLiteral
lib/ssrf.ts:71:12
 function isPrivateIpv6(address: string) {
   const normalized = address.toLowerCase();
   if (normalized === "::1" || normalized === "::") {
-    return true;
+    return false;
   }
 

[NoCoverage] LogicalOperator
lib/ssrf.ts:75:5
   }
 
   if (
-    normalized.startsWith("fc") ||
-    normalized.startsWith("fd") ||
+    normalized.startsWith("fc") && normalized.startsWith("fd") ||
     normalized.startsWith("fe8") ||
     normalized.startsWith("fe9") ||

[NoCoverage] LogicalOperator
lib/ssrf.ts:75:5
   }
 
   if (
-    normalized.startsWith("fc") ||
-    normalized.startsWith("fd") ||
-    normalized.startsWith("fe8") ||
-    normalized.startsWith("fe9") ||
-    normalized.startsWith("fea") ||
+    (normalized.startsWith("fc") || normalized.startsWith("fd") || normalized.startsWith("fe8") || normalized.startsWith("fe9")) && normalized.startsWith("fea") ||
     normalized.startsWith("feb")
   ) {

[NoCoverage] MethodExpression
lib/ssrf.ts:76:5
 
   if (
     normalized.startsWith("fc") ||
-    normalized.startsWith("fd") ||
+    normalized.endsWith("fd") ||
     normalized.startsWith("fe8") ||
     normalized.startsWith("fe9") ||

[NoCoverage] MethodExpression
lib/ssrf.ts:77:5
   if (
     normalized.startsWith("fc") ||
     normalized.startsWith("fd") ||
-    normalized.startsWith("fe8") ||
+    normalized.endsWith("fe8") ||
     normalized.startsWith("fe9") ||
     normalized.startsWith("fea") ||

[NoCoverage] MethodExpression
lib/ssrf.ts:78:5
     normalized.startsWith("fc") ||
     normalized.startsWith("fd") ||
     normalized.startsWith("fe8") ||
-    normalized.startsWith("fe9") ||
+    normalized.endsWith("fe9") ||
     normalized.startsWith("fea") ||
     normalized.startsWith("feb")

[NoCoverage] StringLiteral
lib/ssrf.ts:78:27
     normalized.startsWith("fc") ||
     normalized.startsWith("fd") ||
     normalized.startsWith("fe8") ||
-    normalized.startsWith("fe9") ||
+    normalized.startsWith("") ||
     normalized.startsWith("fea") ||
     normalized.startsWith("feb")

[NoCoverage] MethodExpression
lib/ssrf.ts:79:5
     normalized.startsWith("fd") ||
     normalized.startsWith("fe8") ||
     normalized.startsWith("fe9") ||
-    normalized.startsWith("fea") ||
+    normalized.endsWith("fea") ||
     normalized.startsWith("feb")
   ) {

[NoCoverage] MethodExpression
lib/ssrf.ts:80:5
     normalized.startsWith("fe8") ||
     normalized.startsWith("fe9") ||
     normalized.startsWith("fea") ||
-    normalized.startsWith("feb")
+    normalized.endsWith("feb")
   ) {
     return true;

[NoCoverage] BlockStatement
lib/ssrf.ts:81:5
     normalized.startsWith("fe9") ||
     normalized.startsWith("fea") ||
     normalized.startsWith("feb")
-  ) {
-    return true;
-  }
+  ) {}
 
   if (normalized.startsWith("::ffff:")) {

[NoCoverage] ConditionalExpression
lib/ssrf.ts:85:7
     return true;
   }
 
-  if (normalized.startsWith("::ffff:")) {
+  if (false) {
     const embedded = normalized.slice("::ffff:".length);
     if (embedded && isIP(embedded) === 4) {

[NoCoverage] ConditionalExpression
lib/ssrf.ts:85:7
     return true;
   }
 
-  if (normalized.startsWith("::ffff:")) {
+  if (true) {
     const embedded = normalized.slice("::ffff:".length);
     if (embedded && isIP(embedded) === 4) {

[NoCoverage] MethodExpression
lib/ssrf.ts:86:22
   }
 
   if (normalized.startsWith("::ffff:")) {
-    const embedded = normalized.slice("::ffff:".length);
+    const embedded = normalized;
     if (embedded && isIP(embedded) === 4) {
       return isPrivateIpv4(embedded);

[NoCoverage] StringLiteral
lib/ssrf.ts:86:39
   }
 
   if (normalized.startsWith("::ffff:")) {
-    const embedded = normalized.slice("::ffff:".length);
+    const embedded = normalized.slice("".length);
     if (embedded && isIP(embedded) === 4) {
       return isPrivateIpv4(embedded);

[NoCoverage] LogicalOperator
lib/ssrf.ts:87:9
 
   if (normalized.startsWith("::ffff:")) {
     const embedded = normalized.slice("::ffff:".length);
-    if (embedded && isIP(embedded) === 4) {
+    if (embedded || isIP(embedded) === 4) {
       return isPrivateIpv4(embedded);
     }

[NoCoverage] ConditionalExpression
lib/ssrf.ts:87:9
 
   if (normalized.startsWith("::ffff:")) {
     const embedded = normalized.slice("::ffff:".length);
-    if (embedded && isIP(embedded) === 4) {
+    if (false) {
       return isPrivateIpv4(embedded);
     }

[Killed] BlockStatement
lib/ssrf.ts:95:39
   return false;
 }
 
-function isPrivateIp(address: string) {
-  const family = isIP(address);
-  if (family === 4) {
-    return isPrivateIpv4(address);
-  }
-  if (family === 6) {
-    return isPrivateIpv6(address);
-  }
-  return true;
-}
+function isPrivateIp(address: string) {}
 
 function hasUnsafeHostname(hostname: string) {
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/ssrf.ts:97:7
 
 function isPrivateIp(address: string) {
   const family = isIP(address);
-  if (family === 4) {
+  if (family !== 4) {
     return isPrivateIpv4(address);
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/ssrf.ts:97:21
 
 function isPrivateIp(address: string) {
   const family = isIP(address);
-  if (family === 4) {
-    return isPrivateIpv4(address);
-  }
+  if (family === 4) {}
   if (family === 6) {
     return isPrivateIpv6(address);
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[NoCoverage] ConditionalExpression
lib/ssrf.ts:100:7
   if (family === 4) {
     return isPrivateIpv4(address);
   }
-  if (family === 6) {
+  if (false) {
     return isPrivateIpv6(address);
   }

[NoCoverage] EqualityOperator
lib/ssrf.ts:100:7
   if (family === 4) {
     return isPrivateIpv4(address);
   }
-  if (family === 6) {
+  if (family !== 6) {
     return isPrivateIpv6(address);
   }

[Survived] BlockStatement
lib/ssrf.ts:106:46
   return true;
 }
 
-function hasUnsafeHostname(hostname: string) {
-  return (
-    hostname === "localhost" ||
-    hostname.endsWith(".local") ||
-    hostname.endsWith(".internal") ||
-    hostname.endsWith(".localdomain") ||
-    hostname === "metadata.google.internal"
-  );
-}
+function hasUnsafeHostname(hostname: string) {}
 
 export async function validateOutboundUrl(urlRaw: string): Promise<ValidationResult> {

[Killed] EqualityOperator
lib/ssrf.ts:108:5
 
 function hasUnsafeHostname(hostname: string) {
   return (
-    hostname === "localhost" ||
+    hostname !== "localhost" ||
     hostname.endsWith(".local") ||
     hostname.endsWith(".internal") ||
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/ssrf.ts:108:5
 
 function hasUnsafeHostname(hostname: string) {
   return (
-    hostname === "localhost" ||
-    hostname.endsWith(".local") ||
-    hostname.endsWith(".internal") ||
-    hostname.endsWith(".localdomain") ||
-    hostname === "metadata.google.internal"
+    true
   );
 }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Survived] MethodExpression
lib/ssrf.ts:109:5
 function hasUnsafeHostname(hostname: string) {
   return (
     hostname === "localhost" ||
-    hostname.endsWith(".local") ||
+    hostname.startsWith(".local") ||
     hostname.endsWith(".internal") ||
     hostname.endsWith(".localdomain") ||

[Survived] MethodExpression
lib/ssrf.ts:110:5
   return (
     hostname === "localhost" ||
     hostname.endsWith(".local") ||
-    hostname.endsWith(".internal") ||
+    hostname.startsWith(".internal") ||
     hostname.endsWith(".localdomain") ||
     hostname === "metadata.google.internal"

[Survived] MethodExpression
lib/ssrf.ts:111:5
     hostname === "localhost" ||
     hostname.endsWith(".local") ||
     hostname.endsWith(".internal") ||
-    hostname.endsWith(".localdomain") ||
+    hostname.startsWith(".localdomain") ||
     hostname === "metadata.google.internal"
   );

[Killed] EqualityOperator
lib/ssrf.ts:112:5
     hostname.endsWith(".local") ||
     hostname.endsWith(".internal") ||
     hostname.endsWith(".localdomain") ||
-    hostname === "metadata.google.internal"
+    hostname !== "metadata.google.internal"
   );
 }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Survived] ConditionalExpression
lib/ssrf.ts:112:5
     hostname.endsWith(".local") ||
     hostname.endsWith(".internal") ||
     hostname.endsWith(".localdomain") ||
-    hostname === "metadata.google.internal"
+    false
   );
 }

[Killed] BlockStatement
lib/ssrf.ts:118:7
 
 export async function validateOutboundUrl(urlRaw: string): Promise<ValidationResult> {
   let url: URL;
-  try {
-    url = new URL(urlRaw);
-  } catch {
+  try {} catch {
     return { ok: false, reason: "Invalid URL." };
   }
killedBy: ssrf validator blocks non-https URLs
statusReason: Cannot read properties of undefined (reading 'protocol')

[Killed] BlockStatement
lib/ssrf.ts:120:11
   let url: URL;
   try {
     url = new URL(urlRaw);
-  } catch {
-    return { ok: false, reason: "Invalid URL." };
-  }
+  } catch {}
 
   if (url.protocol !== "https:") {
killedBy: ssrf validator blocks invalid / unparseable URL string
statusReason: Cannot read properties of undefined (reading 'protocol')

[Killed] BooleanLiteral
lib/ssrf.ts:121:18
   try {
     url = new URL(urlRaw);
   } catch {
-    return { ok: false, reason: "Invalid URL." };
+    return { ok: true, reason: "Invalid URL." };
   }
 
killedBy: ssrf validator blocks invalid / unparseable URL string
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/ssrf.ts:124:7
     return { ok: false, reason: "Invalid URL." };
   }
 
-  if (url.protocol !== "https:") {
+  if (true) {
     return { ok: false, reason: "Only HTTPS endpoints are allowed." };
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:124:7
     return { ok: false, reason: "Invalid URL." };
   }
 
-  if (url.protocol !== "https:") {
+  if (url.protocol === "https:") {
     return { ok: false, reason: "Only HTTPS endpoints are allowed." };
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:125:18
   }
 
   if (url.protocol !== "https:") {
-    return { ok: false, reason: "Only HTTPS endpoints are allowed." };
+    return { ok: true, reason: "Only HTTPS endpoints are allowed." };
   }
 
killedBy: ssrf validator blocks non-https URLs
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/ssrf.ts:128:37
     return { ok: false, reason: "Only HTTPS endpoints are allowed." };
   }
 
-  if (url.username || url.password) {
-    return { ok: false, reason: "Credentials in URL are not allowed." };
-  }
+  if (url.username || url.password) {}
 
   const hostname = url.hostname.trim().toLowerCase();
killedBy: ssrf validator blocks URLs with credentials in them
statusReason: expected 'Hostname resolution failed.' to match /credentials/i

[Killed] ConditionalExpression
lib/ssrf.ts:128:7
     return { ok: false, reason: "Only HTTPS endpoints are allowed." };
   }
 
-  if (url.username || url.password) {
+  if (false) {
     return { ok: false, reason: "Credentials in URL are not allowed." };
   }
killedBy: ssrf validator blocks URLs with credentials in them
statusReason: expected 'Hostname resolution failed.' to match /credentials/i

[Killed] BooleanLiteral
lib/ssrf.ts:129:18
   }
 
   if (url.username || url.password) {
-    return { ok: false, reason: "Credentials in URL are not allowed." };
+    return { ok: true, reason: "Credentials in URL are not allowed." };
   }
 
killedBy: ssrf validator blocks URLs with credentials in them
statusReason: expected true to be false // Object.is equality
