[Killed] ObjectLiteral
lib/ssrf.ts:129:12
   }
 
   if (url.username || url.password) {
-    return { ok: false, reason: "Credentials in URL are not allowed." };
+    return {};
   }
 
killedBy: ssrf validator blocks URLs with credentials in them
statusReason: expected undefined to be false // Object.is equality

[Killed] MethodExpression
lib/ssrf.ts:132:20
     return { ok: false, reason: "Credentials in URL are not allowed." };
   }
 
-  const hostname = url.hostname.trim().toLowerCase();
+  const hostname = url.hostname.trim().toUpperCase();
   if (!hostname) {
     return { ok: false, reason: "Hostname is required." };
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
lib/ssrf.ts:132:20
     return { ok: false, reason: "Credentials in URL are not allowed." };
   }
 
-  const hostname = url.hostname.trim().toLowerCase();
+  const hostname = url.hostname.toLowerCase();
   if (!hostname) {
     return { ok: false, reason: "Hostname is required." };

[Killed] ConditionalExpression
lib/ssrf.ts:133:7
   }
 
   const hostname = url.hostname.trim().toLowerCase();
-  if (!hostname) {
+  if (true) {
     return { ok: false, reason: "Hostname is required." };
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:133:7
   }
 
   const hostname = url.hostname.trim().toLowerCase();
-  if (!hostname) {
+  if (hostname) {
     return { ok: false, reason: "Hostname is required." };
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[NoCoverage] BooleanLiteral
lib/ssrf.ts:134:18
 
   const hostname = url.hostname.trim().toLowerCase();
   if (!hostname) {
-    return { ok: false, reason: "Hostname is required." };
+    return { ok: true, reason: "Hostname is required." };
   }
 

[Killed] ConditionalExpression
lib/ssrf.ts:137:7
     return { ok: false, reason: "Hostname is required." };
   }
 
-  if (hasUnsafeHostname(hostname)) {
+  if (true) {
     return { ok: false, reason: "Private hostnames are not allowed." };
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Survived] ConditionalExpression
lib/ssrf.ts:137:7
     return { ok: false, reason: "Hostname is required." };
   }
 
-  if (hasUnsafeHostname(hostname)) {
+  if (false) {
     return { ok: false, reason: "Private hostnames are not allowed." };
   }

[Killed] BooleanLiteral
lib/ssrf.ts:138:18
   }
 
   if (hasUnsafeHostname(hostname)) {
-    return { ok: false, reason: "Private hostnames are not allowed." };
+    return { ok: true, reason: "Private hostnames are not allowed." };
   }
 
killedBy: ssrf validator blocks localhost and private ranges
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/ssrf.ts:142:7
   }
 
   const allowlistHosts = parseAllowlistHosts();
-  if (!isAllowlistedHost(hostname, allowlistHosts)) {
+  if (false) {
     return { ok: false, reason: "Host is not in webhook allowlist." };
   }
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/ssrf.ts:142:7
   }
 
   const allowlistHosts = parseAllowlistHosts();
-  if (!isAllowlistedHost(hostname, allowlistHosts)) {
+  if (isAllowlistedHost(hostname, allowlistHosts)) {
     return { ok: false, reason: "Host is not in webhook allowlist." };
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:143:18
 
   const allowlistHosts = parseAllowlistHosts();
   if (!isAllowlistedHost(hostname, allowlistHosts)) {
-    return { ok: false, reason: "Host is not in webhook allowlist." };
+    return { ok: true, reason: "Host is not in webhook allowlist." };
   }
 
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
lib/ssrf.ts:143:12
 
   const allowlistHosts = parseAllowlistHosts();
   if (!isAllowlistedHost(hostname, allowlistHosts)) {
-    return { ok: false, reason: "Host is not in webhook allowlist." };
+    return {};
   }
 
killedBy: ssrf validator enforces optional allowlist hosts when configured
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
lib/ssrf.ts:146:54
     return { ok: false, reason: "Host is not in webhook allowlist." };
   }
 
-  if (isIP(hostname) !== 0 && isPrivateIp(hostname)) {
-    return { ok: false, reason: "Private or reserved IP addresses are blocked." };
-  }
+  if (isIP(hostname) !== 0 && isPrivateIp(hostname)) {}
 
   try {
killedBy: ssrf validator blocks 172.16-31.x.x private range — boundary values
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/ssrf.ts:146:7
     return { ok: false, reason: "Host is not in webhook allowlist." };
   }
 
-  if (isIP(hostname) !== 0 && isPrivateIp(hostname)) {
+  if (isIP(hostname) === 0 && isPrivateIp(hostname)) {
     return { ok: false, reason: "Private or reserved IP addresses are blocked." };
   }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:147:18
   }
 
   if (isIP(hostname) !== 0 && isPrivateIp(hostname)) {
-    return { ok: false, reason: "Private or reserved IP addresses are blocked." };
+    return { ok: true, reason: "Private or reserved IP addresses are blocked." };
   }
 
killedBy: ssrf validator blocks localhost and private ranges
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/ssrf.ts:150:7
     return { ok: false, reason: "Private or reserved IP addresses are blocked." };
   }
 
-  try {
-    const resolved = await lookup(hostname, { all: true, verbatim: true });
-    if (!resolved.length) {
-      return { ok: false, reason: "Hostname resolution failed." };
-    }
-
-    for (const entry of resolved) {
-      if (isPrivateIp(entry.address)) {
-        return { ok: false, reason: "Resolved to private or reserved IP." };
-      }
-    }
-  } catch {
+  try {} catch {
     return { ok: false, reason: "Hostname resolution failed." };
   }
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
lib/ssrf.ts:151:52
   }
 
   try {
-    const resolved = await lookup(hostname, { all: true, verbatim: true });
+    const resolved = await lookup(hostname, { all: false, verbatim: true });
     if (!resolved.length) {
       return { ok: false, reason: "Hostname resolution failed." };

[Survived] BooleanLiteral
lib/ssrf.ts:151:68
   }
 
   try {
-    const resolved = await lookup(hostname, { all: true, verbatim: true });
+    const resolved = await lookup(hostname, { all: true, verbatim: false });
     if (!resolved.length) {
       return { ok: false, reason: "Hostname resolution failed." };

[Killed] ConditionalExpression
lib/ssrf.ts:152:9
 
   try {
     const resolved = await lookup(hostname, { all: true, verbatim: true });
-    if (!resolved.length) {
+    if (false) {
       return { ok: false, reason: "Hostname resolution failed." };
     }
killedBy: ssrf validator returns error when DNS lookup returns empty list
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/ssrf.ts:152:27
 
   try {
     const resolved = await lookup(hostname, { all: true, verbatim: true });
-    if (!resolved.length) {
-      return { ok: false, reason: "Hostname resolution failed." };
-    }
+    if (!resolved.length) {}
 
     for (const entry of resolved) {
killedBy: ssrf validator returns error when DNS lookup returns empty list
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
lib/ssrf.ts:153:20
   try {
     const resolved = await lookup(hostname, { all: true, verbatim: true });
     if (!resolved.length) {
-      return { ok: false, reason: "Hostname resolution failed." };
+      return { ok: true, reason: "Hostname resolution failed." };
     }
 
killedBy: ssrf validator returns error when DNS lookup returns empty list
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
lib/ssrf.ts:153:35
   try {
     const resolved = await lookup(hostname, { all: true, verbatim: true });
     if (!resolved.length) {
-      return { ok: false, reason: "Hostname resolution failed." };
+      return { ok: false, reason: "" };
     }
 
killedBy: ssrf validator returns error when DNS lookup returns empty list
statusReason: expected '' to match /resolution failed/i

[Killed] BlockStatement
lib/ssrf.ts:156:35
       return { ok: false, reason: "Hostname resolution failed." };
     }
 
-    for (const entry of resolved) {
-      if (isPrivateIp(entry.address)) {
-        return { ok: false, reason: "Resolved to private or reserved IP." };
-      }
-    }
+    for (const entry of resolved) {}
   } catch {
     return { ok: false, reason: "Hostname resolution failed." };
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/ssrf.ts:157:11
     }
 
     for (const entry of resolved) {
-      if (isPrivateIp(entry.address)) {
+      if (false) {
         return { ok: false, reason: "Resolved to private or reserved IP." };
       }
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/ssrf.ts:157:11
     }
 
     for (const entry of resolved) {
-      if (isPrivateIp(entry.address)) {
+      if (true) {
         return { ok: false, reason: "Resolved to private or reserved IP." };
       }
killedBy: ssrf validator allows public domains with public resolution
statusReason: expected { ok: false, …(1) } to match object { ok: true }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:158:22
 
     for (const entry of resolved) {
       if (isPrivateIp(entry.address)) {
-        return { ok: false, reason: "Resolved to private or reserved IP." };
+        return { ok: true, reason: "Resolved to private or reserved IP." };
       }
     }
killedBy: ssrf validator blocks domains resolving to private addresses
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
lib/ssrf.ts:161:11
         return { ok: false, reason: "Resolved to private or reserved IP." };
       }
     }
-  } catch {
-    return { ok: false, reason: "Hostname resolution failed." };
-  }
+  } catch {}
 
   return {
killedBy: ssrf validator blocks IPv6 loopback ::1
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
lib/ssrf.ts:162:18
       }
     }
   } catch {
-    return { ok: false, reason: "Hostname resolution failed." };
+    return { ok: true, reason: "Hostname resolution failed." };
   }
 
killedBy: ssrf validator blocks IPv6 loopback ::1
statusReason: expected { ok: true, …(1) } to match object { ok: false }
(1 matching property omitted from actual)
