[Killed] BlockStatement
lib/verifier.ts:21:33
   };
 };
 
-function tokenize(text: string) {
-  return text
-    .toLowerCase()
-    .replace(/[^a-z0-9\s]/g, " ")
-    .split(/\s+/)
-    .map((token) => token.trim())
-    .filter((token) => token.length > 2);
-}
+function tokenize(text: string) {}
 
 function tokenWindows(tokens: string[], size = 4) {
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
lib/verifier.ts:22:10
 };
 
 function tokenize(text: string) {
-  return text
-    .toLowerCase()
+  return text.toUpperCase()
     .replace(/[^a-z0-9\s]/g, " ")
     .split(/\s+/)
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ Array(1) ] to include 'Follow up on explicitly requested ite…'

[Survived] MethodExpression
lib/verifier.ts:22:10
 };
 
 function tokenize(text: string) {
-  return text
-    .toLowerCase()
-    .replace(/[^a-z0-9\s]/g, " ")
-    .split(/\s+/)
-    .map((token) => token.trim())
-    .filter((token) => token.length > 2);
+  return text.toLowerCase().replace(/[^a-z0-9\s]/g, " ").split(/\s+/).map(token => token.trim());
 }
 

[Killed] ArrowFunction
lib/verifier.ts:26:10
     .toLowerCase()
     .replace(/[^a-z0-9\s]/g, " ")
     .split(/\s+/)
-    .map((token) => token.trim())
+    .map(() => undefined)
     .filter((token) => token.length > 2);
 }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits tokenizer and window edge cases
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] MethodExpression
lib/verifier.ts:26:21
     .toLowerCase()
     .replace(/[^a-z0-9\s]/g, " ")
     .split(/\s+/)
-    .map((token) => token.trim())
+    .map((token) => token)
     .filter((token) => token.length > 2);
 }

[Killed] ArrowFunction
lib/verifier.ts:27:13
     .replace(/[^a-z0-9\s]/g, " ")
     .split(/\s+/)
     .map((token) => token.trim())
-    .filter((token) => token.length > 2);
+    .filter(() => undefined);
 }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ Array(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] ConditionalExpression
lib/verifier.ts:27:24
     .replace(/[^a-z0-9\s]/g, " ")
     .split(/\s+/)
     .map((token) => token.trim())
-    .filter((token) => token.length > 2);
+    .filter((token) => false);
 }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ Array(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] BlockStatement
lib/verifier.ts:30:51
     .filter((token) => token.length > 2);
 }
 
-function tokenWindows(tokens: string[], size = 4) {
-  const windows = new Set<string>();
-  if (tokens.length === 0) {
-    return windows;
-  }
-
-  if (tokens.length <= size) {
-    windows.add(tokens.join(" "));
-    return windows;
-  }
-
-  for (let index = 0; index <= tokens.length - size; index += 1) {
-    windows.add(tokens.slice(index, index + size).join(" "));
-  }
-
-  return windows;
-}
+function tokenWindows(tokens: string[], size = 4) {}
 
 const ACTION_VERBS = new Set([
killedBy: processPayload returns success payload with required meta and steps
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] EqualityOperator
lib/verifier.ts:32:7
 
 function tokenWindows(tokens: string[], size = 4) {
   const windows = new Set<string>();
-  if (tokens.length === 0) {
+  if (tokens.length !== 0) {
     return windows;
   }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Killed] ConditionalExpression
lib/verifier.ts:32:7
 
 function tokenWindows(tokens: string[], size = 4) {
   const windows = new Set<string>();
-  if (tokens.length === 0) {
+  if (true) {
     return windows;
   }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Survived] EqualityOperator
lib/verifier.ts:36:7
     return windows;
   }
 
-  if (tokens.length <= size) {
+  if (tokens.length > size) {
     windows.add(tokens.join(" "));
     return windows;

[Survived] BlockStatement
lib/verifier.ts:36:30
     return windows;
   }
 
-  if (tokens.length <= size) {
-    windows.add(tokens.join(" "));
-    return windows;
-  }
+  if (tokens.length <= size) {}
 
   for (let index = 0; index <= tokens.length - size; index += 1) {

[Survived] ArithmeticOperator
lib/verifier.ts:41:32
     return windows;
   }
 
-  for (let index = 0; index <= tokens.length - size; index += 1) {
+  for (let index = 0; index <= tokens.length + size; index += 1) {
     windows.add(tokens.slice(index, index + size).join(" "));
   }

[Timeout] AssignmentOperator
lib/verifier.ts:41:54
     return windows;
   }
 
-  for (let index = 0; index <= tokens.length - size; index += 1) {
+  for (let index = 0; index <= tokens.length - size; index -= 1) {
     windows.add(tokens.slice(index, index + size).join(" "));
   }

[Survived] ArithmeticOperator
lib/verifier.ts:42:37
   }
 
   for (let index = 0; index <= tokens.length - size; index += 1) {
-    windows.add(tokens.slice(index, index + size).join(" "));
+    windows.add(tokens.slice(index, index - size).join(" "));
   }
 

[Survived] MethodExpression
lib/verifier.ts:42:17
   }
 
   for (let index = 0; index <= tokens.length - size; index += 1) {
-    windows.add(tokens.slice(index, index + size).join(" "));
+    windows.add(tokens.join(" "));
   }
 

[Survived] StringLiteral
lib/verifier.ts:49:3
 }
 
 const ACTION_VERBS = new Set([
-  "send",
+  "",
   "schedule",
   "follow",

[Killed] StringLiteral
lib/verifier.ts:51:3
 const ACTION_VERBS = new Set([
   "send",
   "schedule",
-  "follow",
+  "",
   "review",
   "prepare",
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ Array(1) ] to include 'Follow up on explicitly requested ite…'

[Survived] StringLiteral
lib/verifier.ts:54:3
   "follow",
   "review",
   "prepare",
-  "confirm",
+  "",
   "update",
   "share",

[Survived] StringLiteral
lib/verifier.ts:59:3
   "share",
   "call",
   "email",
-  "draft",
+  "",
   "assign",
   "check",

[Survived] StringLiteral
lib/verifier.ts:61:3
   "email",
   "draft",
   "assign",
-  "check",
+  "",
   "resolve",
   "investigate",

[Survived] StringLiteral
lib/verifier.ts:64:3
   "check",
   "resolve",
   "investigate",
-  "deliver",
+  "",
   "complete",
   "track",

[Survived] StringLiteral
lib/verifier.ts:65:3
   "resolve",
   "investigate",
   "deliver",
-  "complete",
+  "",
   "track",
   "create",

[Survived] StringLiteral
lib/verifier.ts:66:3
   "investigate",
   "deliver",
   "complete",
-  "track",
+  "",
   "create",
   "finalize",

[Survived] StringLiteral
lib/verifier.ts:67:3
   "deliver",
   "complete",
   "track",
-  "create",
+  "",
   "finalize",
 ]);

[Killed] BlockStatement
lib/verifier.ts:71:44
   "finalize",
 ]);
 
-function extractEntityTokens(text: string) {
-  const entities = text.match(/\b[A-Z][a-z]+(?:\s+[A-Z][a-z]+)?\b/g) ?? [];
-  return entities.map((entity) => entity.toLowerCase());
-}
+function extractEntityTokens(text: string) {}
 
 function sentenceList(text: string) {
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: extractEntityTokens is not a function or its return value is not iterable

[Killed] LogicalOperator
lib/verifier.ts:72:20
 ]);
 
 function extractEntityTokens(text: string) {
-  const entities = text.match(/\b[A-Z][a-z]+(?:\s+[A-Z][a-z]+)?\b/g) ?? [];
+  const entities = text.match(/\b[A-Z][a-z]+(?:\s+[A-Z][a-z]+)?\b/g) && [];
   return entities.map((entity) => entity.toLowerCase());
 }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits tokenizer and window edge cases
statusReason: Cannot read properties of null (reading 'map')

[Survived] Regex
lib/verifier.ts:72:31
 ]);
 
 function extractEntityTokens(text: string) {
-  const entities = text.match(/\b[A-Z][a-z]+(?:\s+[A-Z][a-z]+)?\b/g) ?? [];
+  const entities = text.match(/\b[A-Z][a-z]+(?:\s+[A-Z][a-z]+)\b/g) ?? [];
   return entities.map((entity) => entity.toLowerCase());
 }

[Killed] ArrowFunction
lib/verifier.ts:73:23
 
 function extractEntityTokens(text: string) {
   const entities = text.match(/\b[A-Z][a-z]+(?:\s+[A-Z][a-z]+)?\b/g) ?? [];
-  return entities.map((entity) => entity.toLowerCase());
+  return entities.map(() => undefined);
 }
 
killedBy: runGroundingVerifier keeps verifier failed output under reject policy for route-level blocking
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
lib/verifier.ts:73:35
 
 function extractEntityTokens(text: string) {
   const entities = text.match(/\b[A-Z][a-z]+(?:\s+[A-Z][a-z]+)?\b/g) ?? [];
-  return entities.map((entity) => entity.toLowerCase());
+  return entities.map((entity) => entity.toUpperCase());
 }
 

[Killed] BlockStatement
lib/verifier.ts:76:37
   return entities.map((entity) => entity.toLowerCase());
 }
 
-function sentenceList(text: string) {
-  return text
-    .split(/(?<=[.!?])\s+/)
-    .map((line) => line.trim())
-    .filter(Boolean);
-}
+function sentenceList(text: string) {}
 
 function overlapRatio(sourceTokens: Set<string>, line: string) {
killedBy: processPayload returns success payload with required meta and steps
statusReason: Cannot read properties of undefined (reading 'filter')

[Survived] MethodExpression
lib/verifier.ts:77:10
 }
 
 function sentenceList(text: string) {
-  return text
-    .split(/(?<=[.!?])\s+/)
-    .map((line) => line.trim())
-    .filter(Boolean);
+  return text.split(/(?<=[.!?])\s+/).map(line => line.trim());
 }
 

[Survived] Regex
lib/verifier.ts:78:12
 
 function sentenceList(text: string) {
   return text
-    .split(/(?<=[.!?])\s+/)
+    .split(/(?<=[.!?])\S+/)
     .map((line) => line.trim())
     .filter(Boolean);

[Survived] Regex
lib/verifier.ts:78:12
 
 function sentenceList(text: string) {
   return text
-    .split(/(?<=[.!?])\s+/)
+    .split(/(?<=[.!?])\s/)
     .map((line) => line.trim())
     .filter(Boolean);

[Killed] ArrowFunction
lib/verifier.ts:79:10
 function sentenceList(text: string) {
   return text
     .split(/(?<=[.!?])\s+/)
-    .map((line) => line.trim())
+    .map(() => undefined)
     .filter(Boolean);
 }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Totally unrelated stuff about Mars.' to contain 'Please send'

[Survived] MethodExpression
lib/verifier.ts:79:20
 function sentenceList(text: string) {
   return text
     .split(/(?<=[.!?])\s+/)
-    .map((line) => line.trim())
+    .map((line) => line)
     .filter(Boolean);
 }

[Killed] BlockStatement
lib/verifier.ts:83:64
     .filter(Boolean);
 }
 
-function overlapRatio(sourceTokens: Set<string>, line: string) {
-  const tokens = tokenize(line);
-  if (!tokens.length) {
-    return 0;
-  }
-
-  const hits = tokens.filter((token) => sourceTokens.has(token)).length;
-  return hits / tokens.length;
-}
+function overlapRatio(sourceTokens: Set<string>, line: string) {}
 
 export function runGroundingVerifier(input: VerifierInput): VerifierOutput {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Totally unrelated stuff about Mars.' to contain 'Please send'

[Killed] BooleanLiteral
lib/verifier.ts:85:7
 
 function overlapRatio(sourceTokens: Set<string>, line: string) {
   const tokens = tokenize(line);
-  if (!tokens.length) {
+  if (tokens.length) {
     return 0;
   }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected undefined to be 'Follow up: actionable task' // Object.is equality

[Killed] ConditionalExpression
lib/verifier.ts:85:7
 
 function overlapRatio(sourceTokens: Set<string>, line: string) {
   const tokens = tokenize(line);
-  if (!tokens.length) {
+  if (true) {
     return 0;
   }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected undefined to be 'Follow up: actionable task' // Object.is equality

[Killed] MethodExpression
lib/verifier.ts:89:16
     return 0;
   }
 
-  const hits = tokens.filter((token) => sourceTokens.has(token)).length;
+  const hits = tokens.length;
   return hits / tokens.length;
 }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Totally unrelated stuff about Mars.' to contain 'Please send'

[Killed] ArrowFunction
lib/verifier.ts:89:30
     return 0;
   }
 
-  const hits = tokens.filter((token) => sourceTokens.has(token)).length;
+  const hits = tokens.filter(() => undefined).length;
   return hits / tokens.length;
 }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected undefined to be 'Follow up: actionable task' // Object.is equality

[Survived] ArithmeticOperator
lib/verifier.ts:90:10
   }
 
   const hits = tokens.filter((token) => sourceTokens.has(token)).length;
-  return hits / tokens.length;
+  return hits * tokens.length;
 }
 

[Survived] MethodExpression
lib/verifier.ts:101:17
   const flags: string[] = [];
 
   let score = 100;
-  let summary = input.summary.trim();
+  let summary = input.summary;
   let taskList = input.taskList.map((task) => task.trim()).filter(Boolean);
   let emailDraft = input.emailDraft.trim();

[Killed] ArrowFunction
lib/verifier.ts:102:37
 
   let score = 100;
   let summary = input.summary.trim();
-  let taskList = input.taskList.map((task) => task.trim()).filter(Boolean);
+  let taskList = input.taskList.map(() => undefined).filter(Boolean);
   let emailDraft = input.emailDraft.trim();
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [] to include 'Follow up on explicitly requested ite…'

[Survived] MethodExpression
lib/verifier.ts:102:18
 
   let score = 100;
   let summary = input.summary.trim();
-  let taskList = input.taskList.map((task) => task.trim()).filter(Boolean);
+  let taskList = input.taskList.map(task => task.trim());
   let emailDraft = input.emailDraft.trim();
 

[Survived] MethodExpression
lib/verifier.ts:103:20
   let score = 100;
   let summary = input.summary.trim();
   let taskList = input.taskList.map((task) => task.trim()).filter(Boolean);
-  let emailDraft = input.emailDraft.trim();
+  let emailDraft = input.emailDraft;
 
   if (!summary) {

[Killed] AssignmentOperator
lib/verifier.ts:107:5
 
   if (!summary) {
     flags.push("summary_empty");
-    score -= 40;
+    score += 40;
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 61 to be +0 // Object.is equality

[Survived] BooleanLiteral
lib/verifier.ts:110:7
     score -= 40;
   }
 
-  if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
+  if (taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
     flags.push("missing_requested_task");
     score -= 30;

[Survived] ConditionalExpression
lib/verifier.ts:110:7
     score -= 40;
   }
 
-  if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
+  if (false) {
     flags.push("missing_requested_task");
     score -= 30;

[NoCoverage] AssignmentOperator
lib/verifier.ts:112:5
 
   if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
     flags.push("missing_requested_task");
-    score -= 30;
+    score += 30;
   }
 

[Survived] MethodExpression
lib/verifier.ts:116:38
   }
 
   const summarySentences = sentenceList(summary);
-  const lowOverlapSummarySentences = summarySentences.filter(
-    (sentence) => overlapRatio(transcriptTokens, sentence) < 0.2,
-  );
+  const lowOverlapSummarySentences = summarySentences;
   if (lowOverlapSummarySentences.length > 0) {
     flags.push("summary_low_overlap");

[Killed] ArrowFunction
lib/verifier.ts:117:5
 
   const summarySentences = sentenceList(summary);
   const lowOverlapSummarySentences = summarySentences.filter(
-    (sentence) => overlapRatio(transcriptTokens, sentence) < 0.2,
+    () => undefined,
   );
   if (lowOverlapSummarySentences.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Totally unrelated stuff about Mars.' to contain 'Please send'

[Killed] EqualityOperator
lib/verifier.ts:117:19
 
   const summarySentences = sentenceList(summary);
   const lowOverlapSummarySentences = summarySentences.filter(
-    (sentence) => overlapRatio(transcriptTokens, sentence) < 0.2,
+    (sentence) => overlapRatio(transcriptTokens, sentence) >= 0.2,
   );
   if (lowOverlapSummarySentences.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Totally unrelated stuff about Mars.' to contain 'Please send'

[Survived] ConditionalExpression
lib/verifier.ts:119:7
   const lowOverlapSummarySentences = summarySentences.filter(
     (sentence) => overlapRatio(transcriptTokens, sentence) < 0.2,
   );
-  if (lowOverlapSummarySentences.length > 0) {
+  if (false) {
     flags.push("summary_low_overlap");
     score -= Math.min(30, lowOverlapSummarySentences.length * 10);

[Survived] BlockStatement
lib/verifier.ts:119:46
   const lowOverlapSummarySentences = summarySentences.filter(
     (sentence) => overlapRatio(transcriptTokens, sentence) < 0.2,
   );
-  if (lowOverlapSummarySentences.length > 0) {
-    flags.push("summary_low_overlap");
-    score -= Math.min(30, lowOverlapSummarySentences.length * 10);
-  }
+  if (lowOverlapSummarySentences.length > 0) {}
 
   const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) < 0.2);

[Survived] MethodExpression
lib/verifier.ts:121:14
   );
   if (lowOverlapSummarySentences.length > 0) {
     flags.push("summary_low_overlap");
-    score -= Math.min(30, lowOverlapSummarySentences.length * 10);
+    score -= Math.max(30, lowOverlapSummarySentences.length * 10);
   }
 

[Survived] ArithmeticOperator
lib/verifier.ts:121:27
   );
   if (lowOverlapSummarySentences.length > 0) {
     flags.push("summary_low_overlap");
-    score -= Math.min(30, lowOverlapSummarySentences.length * 10);
+    score -= Math.min(30, lowOverlapSummarySentences.length / 10);
   }
 

[Killed] ConditionalExpression
lib/verifier.ts:124:53
     score -= Math.min(30, lowOverlapSummarySentences.length * 10);
   }
 
-  const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) < 0.2);
+  const lowOverlapTasks = taskList.filter((task) => false);
   if (lowOverlapTasks.length > 0) {
     flags.push("task_low_overlap");
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ 'Follow up: Buy milk', …(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] EqualityOperator
lib/verifier.ts:124:53
     score -= Math.min(30, lowOverlapSummarySentences.length * 10);
   }
 
-  const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) < 0.2);
+  const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
   if (lowOverlapTasks.length > 0) {
     flags.push("task_low_overlap");
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ 'Follow up: Buy milk', …(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] ConditionalExpression
lib/verifier.ts:125:7
   }
 
   const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) < 0.2);
-  if (lowOverlapTasks.length > 0) {
+  if (false) {
     flags.push("task_low_overlap");
     score -= Math.min(40, lowOverlapTasks.length * 12);
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 5 to be +0 // Object.is equality

[Killed] BlockStatement
lib/verifier.ts:125:35
   }
 
   const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) < 0.2);
-  if (lowOverlapTasks.length > 0) {
-    flags.push("task_low_overlap");
-    score -= Math.min(40, lowOverlapTasks.length * 12);
-  }
+  if (lowOverlapTasks.length > 0) {}
 
   const nonActionTasks = taskList.filter((task) => {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 5 to be +0 // Object.is equality

[Killed] AssignmentOperator
lib/verifier.ts:127:5
   const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) < 0.2);
   if (lowOverlapTasks.length > 0) {
     flags.push("task_low_overlap");
-    score -= Math.min(40, lowOverlapTasks.length * 12);
+    score += Math.min(40, lowOverlapTasks.length * 12);
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 29 to be +0 // Object.is equality

[Killed] ArithmeticOperator
lib/verifier.ts:127:27
   const lowOverlapTasks = taskList.filter((task) => overlapRatio(transcriptTokens, task) < 0.2);
   if (lowOverlapTasks.length > 0) {
     flags.push("task_low_overlap");
-    score -= Math.min(40, lowOverlapTasks.length * 12);
+    score -= Math.min(40, lowOverlapTasks.length / 12);
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 4.833333333333336 to be +0 // Object.is equality

[Killed] BlockStatement
lib/verifier.ts:130:52
     score -= Math.min(40, lowOverlapTasks.length * 12);
   }
 
-  const nonActionTasks = taskList.filter((task) => {
-    const firstToken = tokenize(task)[0];
-    if (!firstToken) {
-      return true;
-    }
-    if (ACTION_VERBS.has(firstToken)) {
-      return false;
-    }
-    return !/^(to|please)$/i.test(firstToken);
-  });
+  const nonActionTasks = taskList.filter((task) => {});
   if (nonActionTasks.length > 0) {
     flags.push("task_non_actionable");
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected 'actionable task' to be 'Follow up: actionable task' // Object.is equality

[Survived] MethodExpression
lib/verifier.ts:130:26
     score -= Math.min(40, lowOverlapTasks.length * 12);
   }
 
-  const nonActionTasks = taskList.filter((task) => {
-    const firstToken = tokenize(task)[0];
-    if (!firstToken) {
-      return true;
-    }
-    if (ACTION_VERBS.has(firstToken)) {
-      return false;
-    }
-    return !/^(to|please)$/i.test(firstToken);
-  });
+  const nonActionTasks = taskList;
   if (nonActionTasks.length > 0) {
     flags.push("task_non_actionable");

[Survived] BooleanLiteral
lib/verifier.ts:132:9
 
   const nonActionTasks = taskList.filter((task) => {
     const firstToken = tokenize(task)[0];
-    if (!firstToken) {
+    if (firstToken) {
       return true;
     }

[NoCoverage] BlockStatement
lib/verifier.ts:132:22
 
   const nonActionTasks = taskList.filter((task) => {
     const firstToken = tokenize(task)[0];
-    if (!firstToken) {
-      return true;
-    }
+    if (!firstToken) {}
     if (ACTION_VERBS.has(firstToken)) {
       return false;

[NoCoverage] BooleanLiteral
lib/verifier.ts:133:14
   const nonActionTasks = taskList.filter((task) => {
     const firstToken = tokenize(task)[0];
     if (!firstToken) {
-      return true;
+      return false;
     }
     if (ACTION_VERBS.has(firstToken)) {

[Killed] ConditionalExpression
lib/verifier.ts:135:9
     if (!firstToken) {
       return true;
     }
-    if (ACTION_VERBS.has(firstToken)) {
+    if (true) {
       return false;
     }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected 'actionable task' to be 'Follow up: actionable task' // Object.is equality

[Survived] ConditionalExpression
lib/verifier.ts:135:9
     if (!firstToken) {
       return true;
     }
-    if (ACTION_VERBS.has(firstToken)) {
+    if (false) {
       return false;
     }

[Survived] BooleanLiteral
lib/verifier.ts:136:14
       return true;
     }
     if (ACTION_VERBS.has(firstToken)) {
-      return false;
+      return true;
     }
     return !/^(to|please)$/i.test(firstToken);

[Killed] BooleanLiteral
lib/verifier.ts:138:12
     if (ACTION_VERBS.has(firstToken)) {
       return false;
     }
-    return !/^(to|please)$/i.test(firstToken);
+    return /^(to|please)$/i.test(firstToken);
   });
   if (nonActionTasks.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected 'actionable task' to be 'Follow up: actionable task' // Object.is equality

[Survived] Regex
lib/verifier.ts:138:13
     if (ACTION_VERBS.has(firstToken)) {
       return false;
     }
-    return !/^(to|please)$/i.test(firstToken);
+    return !/(to|please)$/i.test(firstToken);
   });
   if (nonActionTasks.length > 0) {

[Killed] BlockStatement
lib/verifier.ts:140:34
     }
     return !/^(to|please)$/i.test(firstToken);
   });
-  if (nonActionTasks.length > 0) {
-    flags.push("task_non_actionable");
-    score -= Math.min(20, nonActionTasks.length * 6);
-  }
+  if (nonActionTasks.length > 0) {}
 
   const outputLines = [summary, ...taskList, emailDraft]
killedBy: runGroundingVerifier flags non-actionable tasks and token window mismatch
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'task_non_actionable'

[Killed] EqualityOperator
lib/verifier.ts:140:7
     }
     return !/^(to|please)$/i.test(firstToken);
   });
-  if (nonActionTasks.length > 0) {
+  if (nonActionTasks.length <= 0) {
     flags.push("task_non_actionable");
     score -= Math.min(20, nonActionTasks.length * 6);
killedBy: runGroundingVerifier flags non-actionable tasks and token window mismatch
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'task_non_actionable'

[Killed] AssignmentOperator
lib/verifier.ts:142:5
   });
   if (nonActionTasks.length > 0) {
     flags.push("task_non_actionable");
-    score -= Math.min(20, nonActionTasks.length * 6);
+    score += Math.min(20, nonActionTasks.length * 6);
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 5 to be +0 // Object.is equality

[Survived] MethodExpression
lib/verifier.ts:142:14
   });
   if (nonActionTasks.length > 0) {
     flags.push("task_non_actionable");
-    score -= Math.min(20, nonActionTasks.length * 6);
+    score -= Math.max(20, nonActionTasks.length * 6);
   }
 

[Survived] MethodExpression
lib/verifier.ts:145:23
     score -= Math.min(20, nonActionTasks.length * 6);
   }
 
-  const outputLines = [summary, ...taskList, emailDraft]
-    .join("\n")
-    .split(/\n+/)
-    .map((line) => line.trim())
-    .filter(Boolean);
+  const outputLines = [summary, ...taskList, emailDraft].join("\n").split(/\n+/).map(line => line.trim());
   const lowWindowLines = outputLines.filter((line) => {
     const tokens = tokenize(line);

[Survived] StringLiteral
lib/verifier.ts:146:11
   }
 
   const outputLines = [summary, ...taskList, emailDraft]
-    .join("\n")
+    .join("")
     .split(/\n+/)
     .map((line) => line.trim())

[Survived] Regex
lib/verifier.ts:147:12
 
   const outputLines = [summary, ...taskList, emailDraft]
     .join("\n")
-    .split(/\n+/)
+    .split(/\n/)
     .map((line) => line.trim())
     .filter(Boolean);

[Killed] ArrowFunction
lib/verifier.ts:148:10
   const outputLines = [summary, ...taskList, emailDraft]
     .join("\n")
     .split(/\n+/)
-    .map((line) => line.trim())
+    .map(() => undefined)
     .filter(Boolean);
   const lowWindowLines = outputLines.filter((line) => {
killedBy: runGroundingVerifier flags non-actionable tasks and token window mismatch
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Survived] MethodExpression
lib/verifier.ts:148:20
   const outputLines = [summary, ...taskList, emailDraft]
     .join("\n")
     .split(/\n+/)
-    .map((line) => line.trim())
+    .map((line) => line)
     .filter(Boolean);
   const lowWindowLines = outputLines.filter((line) => {

[Killed] BlockStatement
lib/verifier.ts:150:55
     .split(/\n+/)
     .map((line) => line.trim())
     .filter(Boolean);
-  const lowWindowLines = outputLines.filter((line) => {
-    const tokens = tokenize(line);
-    if (tokens.length < 4) {
-      return false;
-    }
-    const windows = tokenWindows(tokens, 4);
-    if (!windows.size) {
-      return false;
-    }
-
-    let matches = 0;
-    for (const window of windows) {
-      if (transcriptWindows.has(window)) {
-        matches += 1;
-      }
-    }
-    return matches / windows.size < 0.1;
-  });
+  const lowWindowLines = outputLines.filter((line) => {});
   if (lowWindowLines.length > 0) {
     flags.push("token_window_mismatch");
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'
