[Survived] MethodExpression
lib/verifier.ts:150:26
     .split(/\n+/)
     .map((line) => line.trim())
     .filter(Boolean);
-  const lowWindowLines = outputLines.filter((line) => {
-    const tokens = tokenize(line);
-    if (tokens.length < 4) {
-      return false;
-    }
-    const windows = tokenWindows(tokens, 4);
-    if (!windows.size) {
-      return false;
-    }
-
-    let matches = 0;
-    for (const window of windows) {
-      if (transcriptWindows.has(window)) {
-        matches += 1;
-      }
-    }
-    return matches / windows.size < 0.1;
-  });
+  const lowWindowLines = outputLines;
   if (lowWindowLines.length > 0) {
     flags.push("token_window_mismatch");

[Killed] EqualityOperator
lib/verifier.ts:152:9
     .filter(Boolean);
   const lowWindowLines = outputLines.filter((line) => {
     const tokens = tokenize(line);
-    if (tokens.length < 4) {
+    if (tokens.length >= 4) {
       return false;
     }
killedBy: runGroundingVerifier flags non-actionable tasks and token window mismatch
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Killed] ConditionalExpression
lib/verifier.ts:152:9
     .filter(Boolean);
   const lowWindowLines = outputLines.filter((line) => {
     const tokens = tokenize(line);
-    if (tokens.length < 4) {
+    if (true) {
       return false;
     }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Survived] BooleanLiteral
lib/verifier.ts:153:14
   const lowWindowLines = outputLines.filter((line) => {
     const tokens = tokenize(line);
     if (tokens.length < 4) {
-      return false;
+      return true;
     }
     const windows = tokenWindows(tokens, 4);

[Killed] ConditionalExpression
lib/verifier.ts:156:9
       return false;
     }
     const windows = tokenWindows(tokens, 4);
-    if (!windows.size) {
+    if (true) {
       return false;
     }
killedBy: runGroundingVerifier flags non-actionable tasks and token window mismatch
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Killed] BooleanLiteral
lib/verifier.ts:156:9
       return false;
     }
     const windows = tokenWindows(tokens, 4);
-    if (!windows.size) {
+    if (windows.size) {
       return false;
     }
killedBy: runGroundingVerifier flags non-actionable tasks and token window mismatch
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[NoCoverage] BooleanLiteral
lib/verifier.ts:157:14
     }
     const windows = tokenWindows(tokens, 4);
     if (!windows.size) {
-      return false;
+      return true;
     }
 

[Survived] BlockStatement
lib/verifier.ts:161:35
     }
 
     let matches = 0;
-    for (const window of windows) {
-      if (transcriptWindows.has(window)) {
-        matches += 1;
-      }
-    }
+    for (const window of windows) {}
     return matches / windows.size < 0.1;
   });

[Killed] ConditionalExpression
lib/verifier.ts:162:11
 
     let matches = 0;
     for (const window of windows) {
-      if (transcriptWindows.has(window)) {
+      if (true) {
         matches += 1;
       }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Survived] BlockStatement
lib/verifier.ts:162:42
 
     let matches = 0;
     for (const window of windows) {
-      if (transcriptWindows.has(window)) {
-        matches += 1;
-      }
+      if (transcriptWindows.has(window)) {}
     }
     return matches / windows.size < 0.1;

[Survived] AssignmentOperator
lib/verifier.ts:163:9
     let matches = 0;
     for (const window of windows) {
       if (transcriptWindows.has(window)) {
-        matches += 1;
+        matches -= 1;
       }
     }

[Killed] ConditionalExpression
lib/verifier.ts:166:12
         matches += 1;
       }
     }
-    return matches / windows.size < 0.1;
+    return false;
   });
   if (lowWindowLines.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Killed] EqualityOperator
lib/verifier.ts:166:12
         matches += 1;
       }
     }
-    return matches / windows.size < 0.1;
+    return matches / windows.size >= 0.1;
   });
   if (lowWindowLines.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Killed] EqualityOperator
lib/verifier.ts:168:7
     }
     return matches / windows.size < 0.1;
   });
-  if (lowWindowLines.length > 0) {
+  if (lowWindowLines.length <= 0) {
     flags.push("token_window_mismatch");
     score -= Math.min(20, lowWindowLines.length * 6);
killedBy: runGroundingVerifier flags non-actionable tasks and token window mismatch
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Killed] ConditionalExpression
lib/verifier.ts:168:7
     }
     return matches / windows.size < 0.1;
   });
-  if (lowWindowLines.length > 0) {
+  if (false) {
     flags.push("token_window_mismatch");
     score -= Math.min(20, lowWindowLines.length * 6);
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(4) ] to include 'token_window_mismatch'

[Killed] StringLiteral
lib/verifier.ts:169:16
     return matches / windows.size < 0.1;
   });
   if (lowWindowLines.length > 0) {
-    flags.push("token_window_mismatch");
+    flags.push("");
     score -= Math.min(20, lowWindowLines.length * 6);
   }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits window mismatch with long lines
statusReason: expected [ 'summary_low_overlap', …(5) ] to include 'token_window_mismatch'

[Killed] AssignmentOperator
lib/verifier.ts:170:5
   });
   if (lowWindowLines.length > 0) {
     flags.push("token_window_mismatch");
-    score -= Math.min(20, lowWindowLines.length * 6);
+    score += Math.min(20, lowWindowLines.length * 6);
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 5 to be +0 // Object.is equality

[Survived] ArithmeticOperator
lib/verifier.ts:170:27
   });
   if (lowWindowLines.length > 0) {
     flags.push("token_window_mismatch");
-    score -= Math.min(20, lowWindowLines.length * 6);
+    score -= Math.min(20, lowWindowLines.length / 6);
   }
 

[Survived] StringLiteral
lib/verifier.ts:175:42
 
   const outputEntities = new Set([
     ...extractEntityTokens(summary),
-    ...extractEntityTokens(taskList.join("\n")),
+    ...extractEntityTokens(taskList.join("")),
     ...extractEntityTokens(emailDraft),
   ]);

[Survived] MethodExpression
lib/verifier.ts:178:26
     ...extractEntityTokens(taskList.join("\n")),
     ...extractEntityTokens(emailDraft),
   ]);
-  const leakedEntities = [...outputEntities].filter(
-    (entity) => !transcriptEntityTokens.has(entity),
-  );
+  const leakedEntities = [...outputEntities];
   if (leakedEntities.length > 0) {
     flags.push("entity_leakage");

[Killed] ArrayDeclaration
lib/verifier.ts:178:26
     ...extractEntityTokens(taskList.join("\n")),
     ...extractEntityTokens(emailDraft),
   ]);
-  const leakedEntities = [...outputEntities].filter(
+  const leakedEntities = [].filter(
     (entity) => !transcriptEntityTokens.has(entity),
   );
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits entity leakage with many entities
statusReason: expected [ 'summary_low_overlap', …(3) ] to include 'entity_leakage'

[Killed] BooleanLiteral
lib/verifier.ts:179:17
     ...extractEntityTokens(emailDraft),
   ]);
   const leakedEntities = [...outputEntities].filter(
-    (entity) => !transcriptEntityTokens.has(entity),
+    (entity) => transcriptEntityTokens.has(entity),
   );
   if (leakedEntities.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits entity leakage with many entities
statusReason: expected [ 'summary_low_overlap', …(3) ] to include 'entity_leakage'

[Killed] ArrowFunction
lib/verifier.ts:179:5
     ...extractEntityTokens(emailDraft),
   ]);
   const leakedEntities = [...outputEntities].filter(
-    (entity) => !transcriptEntityTokens.has(entity),
+    () => undefined,
   );
   if (leakedEntities.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits entity leakage with many entities
statusReason: expected [ 'summary_low_overlap', …(3) ] to include 'entity_leakage'

[Killed] BlockStatement
lib/verifier.ts:181:34
   const leakedEntities = [...outputEntities].filter(
     (entity) => !transcriptEntityTokens.has(entity),
   );
-  if (leakedEntities.length > 0) {
-    flags.push("entity_leakage");
-    flags.push(`entity_mismatch:${leakedEntities.slice(0, 3).join(",")}`);
-    score -= Math.min(30, leakedEntities.length * 6);
-  }
+  if (leakedEntities.length > 0) {}
 
   if (!/please review before sending\.?$/im.test(emailDraft)) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits entity leakage with many entities
statusReason: expected [ 'summary_low_overlap', …(3) ] to include 'entity_leakage'

[Killed] ConditionalExpression
lib/verifier.ts:181:7
   const leakedEntities = [...outputEntities].filter(
     (entity) => !transcriptEntityTokens.has(entity),
   );
-  if (leakedEntities.length > 0) {
+  if (false) {
     flags.push("entity_leakage");
     flags.push(`entity_mismatch:${leakedEntities.slice(0, 3).join(",")}`);
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits entity leakage with many entities
statusReason: expected [ 'summary_low_overlap', …(3) ] to include 'entity_leakage'

[Killed] MethodExpression
lib/verifier.ts:183:35
   );
   if (leakedEntities.length > 0) {
     flags.push("entity_leakage");
-    flags.push(`entity_mismatch:${leakedEntities.slice(0, 3).join(",")}`);
+    flags.push(`entity_mismatch:${leakedEntities.join(",")}`);
     score -= Math.min(30, leakedEntities.length * 6);
   }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits entity leakage with many entities
statusReason: expected 7 to be less than or equal to 3

[Killed] AssignmentOperator
lib/verifier.ts:184:5
   if (leakedEntities.length > 0) {
     flags.push("entity_leakage");
     flags.push(`entity_mismatch:${leakedEntities.slice(0, 3).join(",")}`);
-    score -= Math.min(30, leakedEntities.length * 6);
+    score += Math.min(30, leakedEntities.length * 6);
   }
 
killedBy: processPayload returns verifier rejection under reject policy
statusReason: promise resolved "{ inputMode: 'text', …(6) }" instead of rejecting

[Survived] ArithmeticOperator
lib/verifier.ts:184:27
   if (leakedEntities.length > 0) {
     flags.push("entity_leakage");
     flags.push(`entity_mismatch:${leakedEntities.slice(0, 3).join(",")}`);
-    score -= Math.min(30, leakedEntities.length * 6);
+    score -= Math.min(30, leakedEntities.length / 6);
   }
 

[Killed] BlockStatement
lib/verifier.ts:187:63
     score -= Math.min(30, leakedEntities.length * 6);
   }
 
-  if (!/please review before sending\.?$/im.test(emailDraft)) {
-    flags.push("email_footer_missing");
-    score -= 10;
-  }
+  if (!/please review before sending\.?$/im.test(emailDraft)) {}
 
   if (!/^subject:/i.test(emailDraft)) {
killedBy: runGroundingVerifier flags empty summary and missing subject/footer
statusReason: expected [ 'summary_empty', …(3) ] to include 'email_footer_missing'

[Killed] ConditionalExpression
lib/verifier.ts:187:7
     score -= Math.min(30, leakedEntities.length * 6);
   }
 
-  if (!/please review before sending\.?$/im.test(emailDraft)) {
+  if (false) {
     flags.push("email_footer_missing");
     score -= 10;
killedBy: runGroundingVerifier flags empty summary and missing subject/footer
statusReason: expected [ 'summary_empty', …(3) ] to include 'email_footer_missing'

[Killed] StringLiteral
lib/verifier.ts:188:16
   }
 
   if (!/please review before sending\.?$/im.test(emailDraft)) {
-    flags.push("email_footer_missing");
+    flags.push("");
     score -= 10;
   }
killedBy: runGroundingVerifier flags empty summary and missing subject/footer
statusReason: expected [ 'summary_empty', …(4) ] to include 'email_footer_missing'

[Killed] AssignmentOperator
lib/verifier.ts:189:5
 
   if (!/please review before sending\.?$/im.test(emailDraft)) {
     flags.push("email_footer_missing");
-    score -= 10;
+    score += 10;
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
lib/verifier.ts:192:7
     score -= 10;
   }
 
-  if (!/^subject:/i.test(emailDraft)) {
+  if (false) {
     flags.push("email_subject_missing");
     score -= 15;
killedBy: runGroundingVerifier flags empty summary and missing subject/footer
statusReason: expected [ 'summary_empty', …(3) ] to include 'email_subject_missing'

[Killed] BooleanLiteral
lib/verifier.ts:192:7
     score -= 10;
   }
 
-  if (!/^subject:/i.test(emailDraft)) {
+  if (/^subject:/i.test(emailDraft)) {
     flags.push("email_subject_missing");
     score -= 15;
killedBy: runGroundingVerifier flags empty summary and missing subject/footer
statusReason: expected [ 'summary_empty', …(3) ] to include 'email_subject_missing'

[Killed] StringLiteral
lib/verifier.ts:193:16
   }
 
   if (!/^subject:/i.test(emailDraft)) {
-    flags.push("email_subject_missing");
+    flags.push("");
     score -= 15;
   }
killedBy: runGroundingVerifier flags empty summary and missing subject/footer
statusReason: expected [ 'summary_empty', …(4) ] to include 'email_subject_missing'

[Killed] AssignmentOperator
lib/verifier.ts:194:5
 
   if (!/^subject:/i.test(emailDraft)) {
     flags.push("email_subject_missing");
-    score -= 15;
+    score += 15;
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 11 to be +0 // Object.is equality

[Killed] EqualityOperator
lib/verifier.ts:197:36
     score -= 15;
   }
 
-  if (input.policy === "repair" && flags.length > 0) {
+  if (input.policy === "repair" && flags.length <= 0) {
     if (!summary || lowOverlapSummarySentences.length > 0) {
       summary =
killedBy: runGroundingVerifier repairs output under repair policy
statusReason: expected 'body without header' to contain 'subject:'

[Killed] ConditionalExpression
lib/verifier.ts:197:7
     score -= 15;
   }
 
-  if (input.policy === "repair" && flags.length > 0) {
+  if (true) {
     if (!summary || lowOverlapSummarySentences.length > 0) {
       summary =
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits scoring lower bounds
statusReason: expected 75 to be +0 // Object.is equality

[Killed] EqualityOperator
lib/verifier.ts:198:21
   }
 
   if (input.policy === "repair" && flags.length > 0) {
-    if (!summary || lowOverlapSummarySentences.length > 0) {
+    if (!summary || lowOverlapSummarySentences.length <= 0) {
       summary =
         sentenceList(input.transcript).slice(0, 2).join(" ") ||
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Totally unrelated stuff about Mars.' to contain 'Please send'

[Killed] ConditionalExpression
lib/verifier.ts:198:9
   }
 
   if (input.policy === "repair" && flags.length > 0) {
-    if (!summary || lowOverlapSummarySentences.length > 0) {
+    if (false) {
       summary =
         sentenceList(input.transcript).slice(0, 2).join(" ") ||
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Totally unrelated stuff about Mars.' to contain 'Please send'

[Killed] ConditionalExpression
lib/verifier.ts:200:9
   if (input.policy === "repair" && flags.length > 0) {
     if (!summary || lowOverlapSummarySentences.length > 0) {
       summary =
-        sentenceList(input.transcript).slice(0, 2).join(" ") ||
-        "Summary unavailable due to grounding repair.";
+        false;
     }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [] to include 'Please send'

[Killed] LogicalOperator
lib/verifier.ts:200:9
   if (input.policy === "repair" && flags.length > 0) {
     if (!summary || lowOverlapSummarySentences.length > 0) {
       summary =
-        sentenceList(input.transcript).slice(0, 2).join(" ") ||
-        "Summary unavailable due to grounding repair.";
+        sentenceList(input.transcript).slice(0, 2).join(" ") && "Summary unavailable due to grounding repair.";
     }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Summary unavailable due to grounding …' to contain 'Please send'

[NoCoverage] StringLiteral
lib/verifier.ts:201:9
     if (!summary || lowOverlapSummarySentences.length > 0) {
       summary =
         sentenceList(input.transcript).slice(0, 2).join(" ") ||
-        "Summary unavailable due to grounding repair.";
+        "";
     }
 

[Killed] BlockStatement
lib/verifier.ts:204:37
         "Summary unavailable due to grounding repair.";
     }
 
-    if (lowOverlapTasks.length > 0) {
-      taskList = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
-      if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
-        taskList = ["Follow up on explicitly requested items from transcript."];
-      }
-    }
+    if (lowOverlapTasks.length > 0) {}
     if (nonActionTasks.length > 0) {
       taskList = taskList.map((task) => {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ 'Follow up: Buy milk', …(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] ConditionalExpression
lib/verifier.ts:204:9
         "Summary unavailable due to grounding repair.";
     }
 
-    if (lowOverlapTasks.length > 0) {
+    if (false) {
       taskList = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
       if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ 'Follow up: Buy milk', …(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] MethodExpression
lib/verifier.ts:205:18
     }
 
     if (lowOverlapTasks.length > 0) {
-      taskList = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
+      taskList = taskList;
       if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
         taskList = ["Follow up on explicitly requested items from transcript."];
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ 'Follow up: Buy milk', …(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] ConditionalExpression
lib/verifier.ts:205:44
     }
 
     if (lowOverlapTasks.length > 0) {
-      taskList = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
+      taskList = taskList.filter((task) => true);
       if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
         taskList = ["Follow up on explicitly requested items from transcript."];
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ 'Follow up: Buy milk', …(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] BlockStatement
lib/verifier.ts:206:111
 
     if (lowOverlapTasks.length > 0) {
       taskList = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
-      if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
-        taskList = ["Follow up on explicitly requested items from transcript."];
-      }
+      if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {}
     }
     if (nonActionTasks.length > 0) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [] to include 'Follow up on explicitly requested ite…'

[Killed] BooleanLiteral
lib/verifier.ts:206:11
 
     if (lowOverlapTasks.length > 0) {
       taskList = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
-      if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
+      if (taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
         taskList = ["Follow up on explicitly requested items from transcript."];
       }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [] to include 'Follow up on explicitly requested ite…'

[Killed] ArrayDeclaration
lib/verifier.ts:207:20
     if (lowOverlapTasks.length > 0) {
       taskList = taskList.filter((task) => overlapRatio(transcriptTokens, task) >= 0.2);
       if (!taskList.length && /\b(please|need to|can you|follow up|schedule|send)\b/i.test(input.transcript)) {
-        taskList = ["Follow up on explicitly requested items from transcript."];
+        taskList = [];
       }
     }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [] to include 'Follow up on explicitly requested ite…'

[Killed] EqualityOperator
lib/verifier.ts:210:9
         taskList = ["Follow up on explicitly requested items from transcript."];
       }
     }
-    if (nonActionTasks.length > 0) {
+    if (nonActionTasks.length <= 0) {
       taskList = taskList.map((task) => {
         const firstToken = tokenize(task)[0];
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected 'actionable task' to be 'Follow up: actionable task' // Object.is equality

[Killed] ConditionalExpression
lib/verifier.ts:210:9
         taskList = ["Follow up on explicitly requested items from transcript."];
       }
     }
-    if (nonActionTasks.length > 0) {
+    if (false) {
       taskList = taskList.map((task) => {
         const firstToken = tokenize(task)[0];
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected 'actionable task' to be 'Follow up: actionable task' // Object.is equality

[Killed] BlockStatement
lib/verifier.ts:211:41
       }
     }
     if (nonActionTasks.length > 0) {
-      taskList = taskList.map((task) => {
-        const firstToken = tokenize(task)[0];
-        if (firstToken && ACTION_VERBS.has(firstToken)) {
-          return task;
-        }
-        return `Follow up: ${task}`;
-      });
+      taskList = taskList.map((task) => {});
     }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ undefined ] to include 'Follow up on explicitly requested ite…'

[Killed] LogicalOperator
lib/verifier.ts:213:13
     if (nonActionTasks.length > 0) {
       taskList = taskList.map((task) => {
         const firstToken = tokenize(task)[0];
-        if (firstToken && ACTION_VERBS.has(firstToken)) {
+        if (firstToken || ACTION_VERBS.has(firstToken)) {
           return task;
         }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits non-actionable repair
statusReason: expected 'actionable task' to be 'Follow up: actionable task' // Object.is equality

[Killed] ConditionalExpression
lib/verifier.ts:213:13
     if (nonActionTasks.length > 0) {
       taskList = taskList.map((task) => {
         const firstToken = tokenize(task)[0];
-        if (firstToken && ACTION_VERBS.has(firstToken)) {
+        if (false) {
           return task;
         }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected [ Array(1) ] to include 'Follow up on explicitly requested ite…'

[Killed] BlockStatement
lib/verifier.ts:220:41
       });
     }
 
-    if (!/^subject:/i.test(emailDraft)) {
-      emailDraft = `Subject: Transcript Follow-up\n\n${emailDraft}`;
-    }
+    if (!/^subject:/i.test(emailDraft)) {}
     if (!/please review before sending\.?$/im.test(emailDraft)) {
       emailDraft = `${emailDraft}\n\nPlease review before sending.`;
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Draft\n\nPlease review before sending.' to contain 'Subject:'

[Killed] StringLiteral
lib/verifier.ts:221:20
     }
 
     if (!/^subject:/i.test(emailDraft)) {
-      emailDraft = `Subject: Transcript Follow-up\n\n${emailDraft}`;
+      emailDraft = ``;
     }
     if (!/please review before sending\.?$/im.test(emailDraft)) {
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected '\n\nPlease review before sending.' to contain 'Subject:'

[Killed] BlockStatement
lib/verifier.ts:223:65
     if (!/^subject:/i.test(emailDraft)) {
       emailDraft = `Subject: Transcript Follow-up\n\n${emailDraft}`;
     }
-    if (!/please review before sending\.?$/im.test(emailDraft)) {
-      emailDraft = `${emailDraft}\n\nPlease review before sending.`;
-    }
+    if (!/please review before sending\.?$/im.test(emailDraft)) {}
 
     score = Math.max(score, 75);
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Subject: Transcript Follow-up\n\nDraft' to contain 'Please review'

[Killed] ConditionalExpression
lib/verifier.ts:223:9
     if (!/^subject:/i.test(emailDraft)) {
       emailDraft = `Subject: Transcript Follow-up\n\n${emailDraft}`;
     }
-    if (!/please review before sending\.?$/im.test(emailDraft)) {
+    if (false) {
       emailDraft = `${emailDraft}\n\nPlease review before sending.`;
     }
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected 'Subject: Transcript Follow-up\n\nDraft' to contain 'Please review'

[Killed] StringLiteral
lib/verifier.ts:224:20
       emailDraft = `Subject: Transcript Follow-up\n\n${emailDraft}`;
     }
     if (!/please review before sending\.?$/im.test(emailDraft)) {
-      emailDraft = `${emailDraft}\n\nPlease review before sending.`;
+      emailDraft = ``;
     }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected '' to contain 'Subject:'

[Killed] MethodExpression
lib/verifier.ts:227:13
       emailDraft = `${emailDraft}\n\nPlease review before sending.`;
     }
 
-    score = Math.max(score, 75);
+    score = Math.min(score, 75);
   }
 
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected +0 to be 75 // Object.is equality

[Killed] EqualityOperator
lib/verifier.ts:230:14
     score = Math.max(score, 75);
   }
 
-  const ok = score >= 70 && !flags.includes("summary_empty");
+  const ok = score < 70 && !flags.includes("summary_empty");
 
   return {
killedBy: processPayload returns verifier rejection under reject policy
statusReason: promise resolved "{ inputMode: 'text', …(6) }" instead of rejecting

[Killed] LogicalOperator
lib/verifier.ts:230:14
     score = Math.max(score, 75);
   }
 
-  const ok = score >= 70 && !flags.includes("summary_empty");
+  const ok = score >= 70 || !flags.includes("summary_empty");
 
   return {
killedBy: processPayload returns verifier rejection under reject policy
statusReason: promise resolved "{ inputMode: 'text', …(6) }" instead of rejecting

[Killed] ObjectLiteral
lib/verifier.ts:232:10
 
   const ok = score >= 70 && !flags.includes("summary_empty");
 
-  return {
-    report: {
-      ok,
-      score: Math.max(0, Math.min(100, score)),
-      flags,
-      policy: input.policy,
-    },
-    repaired: {
-      summary,
-      taskList,
-      emailDraft,
-    },
-  };
+  return {};
 }
 
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Cannot read properties of undefined (reading 'summary')

[Killed] ObjectLiteral
lib/verifier.ts:233:13
   const ok = score >= 70 && !flags.includes("summary_empty");
 
   return {
-    report: {
-      ok,
-      score: Math.max(0, Math.min(100, score)),
-      flags,
-      policy: input.policy,
-    },
+    report: {},
     repaired: {
       summary,
killedBy: /api/process contract snapshot keeps the response shape stable
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
lib/verifier.ts:235:26
   return {
     report: {
       ok,
-      score: Math.max(0, Math.min(100, score)),
+      score: Math.max(0, Math.max(100, score)),
       flags,
       policy: input.policy,
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits tokenizer and window edge cases
statusReason: expected 100 to be less than 100

[Killed] MethodExpression
lib/verifier.ts:235:14
   return {
     report: {
       ok,
-      score: Math.max(0, Math.min(100, score)),
+      score: Math.min(0, Math.min(100, score)),
       flags,
       policy: input.policy,
killedBy: ScanLedger: 100% Coverage Suite lib/verifier.ts hits repair policy branches
statusReason: expected +0 to be 75 // Object.is equality
